python/base/python的函数和对象.org
#+OPTIONS: ^:nil
#+AUTHORS: linuxhui





* 简单了解函数

** 函数是什么
A function is a piece of code in a program. The function performs a specific task.

在Python中，函数是第一等公民。这意味着函数和Python的其他object一样拥有状态。可以被赋值给变量，储存在Collections或者当作参数进行传送，这给语言带来了很大的灵活性。

在python中有两种函数。内置函数和自定义函数。内置函数是python的一部分。自定义函数需要使用关键字"def"进行创建。

** 函数的好处
+ Reducing duplication of code
+ Decomposing complex problems into simpler pieces
+ Improving clarity of the code
+ Reuse of code
+ Information hiding

** 函数和过程的区别
函数和过程都是可以被调用的实体。但是函数和过程最大的区别在于函数有返回值，而过程没有返回值。

*** python的函数和过程
在python中，过程其实就是函数，解释器会隐形的返回一个默认值None。另外的一个意思就是函数一般情况下使用return进行状态的返回。

*** common lisp中的函数(简述)
在cl中函数的定义：
#+BEGIN_SRC elisp
  ; 这个定义引用的是冰河伞哥的定义
  (defun funname (parameter*)
    "doc"
    body-form*)
#+END_SRC


在cl中，如果没有加入返回语句，body-form*的最后一个语句将被作为函数的返回值给调用者。这也是和很多计算机语言不同的地方。

** 函数定义
函数使用关键字"def"进行定义，声明部分必须使用缩进。
#+BEGIN_SRC python
  def function():
      pass
#+END_SRC

*Note:* 
+ 定义部分默认大家都会，这里不讨论参数,以及函数的引用等内容.
+ def在函数定义中不是必须的，比如lambda表达式。在另外一片文章迭代器中会详细讲述lambda。

** function的赋值和执行
#+BEGIN_EXAMPLE
  def x():
      pass

  # p 为x()函数执行的值
  p = x()
  # 将函数x赋值给p
  p = x
  # 执行函数x()
  p()
#+END_EXAMPLE

* function 和 object

** function是一个object
在python中万物皆对象，function也不例外，一定要记住这句话。 因此函数可以像其他的object一样被使用，再次声明一下，function在python中是一等公民。
#+BEGIN_SRC python
  def shout(word="yes"):
      return word.capitalize()+"!"

  print shout()
  # outputs : 'Yes!'

  # 作为一个object，你可以将函数想其他object一样赋值给一个变量
  scream = shout

  # 注意： 我们不使用继承(parentheses,我们不执行这个函数，仅仅是将函数"shot"赋值给变量”scream“。
  # 也就是说你可以从scream执行shout()

  print scream()
  # outputs : 'Yes!'


  # 不止如此，虽然删除老的名称shout，但是通过变量scream依然可以调用shout。这是因为函数shout的
  # 引用计数不为0，所以依然没有在解释器中删除。


  del shout
  try:
      print shout()
  except NameError, e:
      print e
      #outputs: "name 'shout' is not defined"

  print scream()
  # outputs: 'Yes!'
#+END_SRC

** 函数可以被定义到一个函数里
#+BEGIN_SRC python 
  def talk():

      # 定义函数whisper
      def whisper(word="yes"):
          return word.lower()+"..."

      # 调用whisper函数

      print whisper()


  # 每次你执行 "talk"的时候, "whisper"每次都会被定义.然后被talk执行.
  talk()
  # outputs: 
  # "yes..."


  # 但是 "whisper" 在"talk"之外不存在
  try:
      print whisper()
  except NameError, e:
      print e
      #outputs : "name 'whisper' is not defined"*
      Python's functions are objects
#+END_SRC

从上面的两个例子可以知道,functions 是objects 因为函数：
 + 能赋值给一个变量
 + 能定义在其他的函数中间。

