python/base/python的函数和对象.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2015-11-22 日 17:36 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title></title>
<meta  name="generator" content="Org-mode" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline8">1. 简单了解函数</a>
<ul>
<li><a href="#orgheadline1">1.1. 函数是什么</a></li>
<li><a href="#orgheadline2">1.2. 函数的好处</a></li>
<li><a href="#orgheadline5">1.3. 函数和过程的区别</a>
<ul>
<li><a href="#orgheadline3">1.3.1. python的函数和过程</a></li>
<li><a href="#orgheadline4">1.3.2. common lisp中的函数(简述)</a></li>
</ul>
</li>
<li><a href="#orgheadline6">1.4. 函数定义</a></li>
<li><a href="#orgheadline7">1.5. function的赋值和执行</a></li>
</ul>
</li>
<li><a href="#orgheadline13">2. function 和 object</a>
<ul>
<li><a href="#orgheadline9">2.1. function是一个object</a></li>
<li><a href="#orgheadline10">2.2. 函数可以被定义到一个函数里</a></li>
<li><a href="#orgheadline11">2.3. 函数可以返回一个函数</a></li>
<li><a href="#orgheadline12">2.4. 函数作为一个参数</a></li>
</ul>
</li>
<li><a href="#orgheadline14">3. function 和 method</a></li>
<li><a href="#orgheadline17">4. function 和 decorator</a>
<ul>
<li><a href="#orgheadline15">4.1. 自制一个装饰器</a></li>
<li><a href="#orgheadline16">4.2. 解开Decorators的神秘面纱</a></li>
</ul>
</li>
<li><a href="#orgheadline23">5. 装饰器进阶</a>
<ul>
<li><a href="#orgheadline18">5.1. 装饰方法</a></li>
<li><a href="#orgheadline19">5.2. 传递参数到decorator</a></li>
<li><a href="#orgheadline20">5.3. 练习: 装饰一个装饰器</a></li>
<li><a href="#orgheadline21">5.4. 最好的实践: 装饰器</a></li>
<li><a href="#orgheadline22">5.5. 如何理解装饰器的执行步骤.</a></li>
</ul>
</li>
<li><a href="#orgheadline30">6. 装饰器的用处</a>
<ul>
<li><a href="#orgheadline24">6.1. 装饰器有什么用</a></li>
<li><a href="#orgheadline28">6.2. python的内置装饰器</a>
<ul>
<li><a href="#orgheadline25">6.2.1. staticmethod</a></li>
<li><a href="#orgheadline26">6.2.2. classmethod</a></li>
<li><a href="#orgheadline27">6.2.3. property</a></li>
</ul>
</li>
<li><a href="#orgheadline29">6.3. 这不是魔法系列(主要是flask的url解析)</a></li>
</ul>
</li>
<li><a href="#orgheadline37">7. 这不是魔法</a>
<ul>
<li><a href="#orgheadline31">7.1. 前言</a></li>
<li><a href="#orgheadline32">7.2. 装饰器</a></li>
<li><a href="#orgheadline33">7.3. 将 app 放进app.route</a></li>
<li><a href="#orgheadline34">7.4. 以正则的形式表达我们的路径</a></li>
<li><a href="#orgheadline35">7.5. 命名捕获组</a></li>
<li><a href="#orgheadline36">7.6. 推陈出新</a></li>
</ul>
</li>
<li><a href="#orgheadline38">8. 建议阅读:</a></li>
<li><a href="#orgheadline39">9. 引用文件</a></li>
</ul>
</div>
</div>





<div id="outline-container-orgheadline8" class="outline-2">
<h2 id="orgheadline8"><span class="section-number-2">1</span> 简单了解函数</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-orgheadline1" class="outline-3">
<h3 id="orgheadline1"><span class="section-number-3">1.1</span> 函数是什么</h3>
<div class="outline-text-3" id="text-1-1">
<p>
A function is a piece of code in a program. The function performs a specific task.
</p>

<p>
在Python中，函数是第一等公民。这意味着函数和Python的其他object一样拥有状态。可以被赋值给变量，储存在Collections或者当作参数进行传送，这给语言带来了很大的灵活性。
</p>

<p>
在python中有两种函数。内置函数和自定义函数。内置函数是python的一部分。自定义函数需要使用关键字"def"进行创建。
</p>
</div>
</div>

<div id="outline-container-orgheadline2" class="outline-3">
<h3 id="orgheadline2"><span class="section-number-3">1.2</span> 函数的好处</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>Reducing duplication of code</li>
<li>Decomposing complex problems into simpler pieces</li>
<li>Improving clarity of the code</li>
<li>Reuse of code</li>
<li>Information hiding</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline5" class="outline-3">
<h3 id="orgheadline5"><span class="section-number-3">1.3</span> 函数和过程的区别</h3>
<div class="outline-text-3" id="text-1-3">
<p>
函数和过程都是可以被调用的实体。但是函数和过程最大的区别在于函数有返回值，而过程没有返回值。
</p>
</div>

<div id="outline-container-orgheadline3" class="outline-4">
<h4 id="orgheadline3"><span class="section-number-4">1.3.1</span> python的函数和过程</h4>
<div class="outline-text-4" id="text-1-3-1">
<p>
在python中，过程其实就是函数，解释器会隐形的返回一个默认值None。另外的一个意思就是函数一般情况下使用return进行状态的返回。
</p>
</div>
</div>

<div id="outline-container-orgheadline4" class="outline-4">
<h4 id="orgheadline4"><span class="section-number-4">1.3.2</span> common lisp中的函数(简述)</h4>
<div class="outline-text-4" id="text-1-3-2">
<p>
在cl中函数的定义：
</p>
<div class="org-src-container">

<pre class="src src-elisp"><span style="color: #2aa1ae; background-color: #292e34;">; </span><span style="color: #2aa1ae; background-color: #292e34;">&#36825;&#20010;&#23450;&#20041;&#24341;&#29992;&#30340;&#26159;&#20912;&#27827;&#20254;&#21733;&#30340;&#23450;&#20041;</span>
<span style="color: #2f96dc;">(</span><span style="color: #237fbf; font-weight: bold;">defun</span> <span style="color: #bc6ec5; font-weight: bold;">funname</span> <span style="color: #bc6ec5;">(</span>parameter*<span style="color: #bc6ec5;">)</span>
  <span style="color: #2aa1ae;">"doc"</span>
  body-form*<span style="color: #2f96dc;">)</span>
</pre>
</div>


<p>
在cl中，如果没有加入返回语句，body-form*的最后一个语句将被作为函数的返回值给调用者。这也是和很多计算机语言不同的地方。
</p>
</div>
</div>
</div>

<div id="outline-container-orgheadline6" class="outline-3">
<h3 id="orgheadline6"><span class="section-number-3">1.4</span> 函数定义</h3>
<div class="outline-text-3" id="text-1-4">
<p>
函数使用关键字"def"进行定义，声明部分必须使用缩进。
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">function</span><span style="color: #2f96dc;">()</span>:
    <span style="color: #237fbf; font-weight: bold;">pass</span>
</pre>
</div>

<p>
<b>Note:</b> 
</p>
<ul class="org-ul">
<li>定义部分默认大家都会，这里不讨论参数,以及函数的引用等内容.</li>
<li>def在函数定义中不是必须的，比如lambda表达式。在另外一片文章迭代器中会详细讲述lambda。</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline7" class="outline-3">
<h3 id="orgheadline7"><span class="section-number-3">1.5</span> function的赋值和执行</h3>
<div class="outline-text-3" id="text-1-5">
<pre class="example">
def x():
    pass

# p 为x()函数执行的值
p = x()
# 将函数x赋值给p
p = x
# 执行函数x()
p()
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline13" class="outline-2">
<h2 id="orgheadline13"><span class="section-number-2">2</span> function 和 object</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-orgheadline9" class="outline-3">
<h3 id="orgheadline9"><span class="section-number-3">2.1</span> function是一个object</h3>
<div class="outline-text-3" id="text-2-1">
<p>
在python中万物皆对象，function也不例外，一定要记住这句话。 因此函数可以像其他的object一样被使用，再次声明一下，function在python中是一等公民。
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">shout</span><span style="color: #2f96dc;">(</span>word=<span style="color: #2d9574;">"yes"</span><span style="color: #2f96dc;">)</span>:
    <span style="color: #237fbf; font-weight: bold;">return</span> word.capitalize<span style="color: #2f96dc;">()</span>+<span style="color: #2d9574;">"!"</span>

<span style="color: #237fbf; font-weight: bold;">print</span> shout<span style="color: #2f96dc;">()</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">outputs : 'Yes!'</span>

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#20316;&#20026;&#19968;&#20010;object&#65292;&#20320;&#21487;&#20197;&#23558;&#20989;&#25968;&#24819;&#20854;&#20182;object&#19968;&#26679;&#36171;&#20540;&#32473;&#19968;&#20010;&#21464;&#37327;</span>
<span style="color: #7590db;">scream</span> = shout

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#27880;&#24847;&#65306; &#25105;&#20204;&#19981;&#20351;&#29992;&#32487;&#25215;(parentheses,&#25105;&#20204;&#19981;&#25191;&#34892;&#36825;&#20010;&#20989;&#25968;&#65292;&#20165;&#20165;&#26159;&#23558;&#20989;&#25968;"shot"&#36171;&#20540;&#32473;&#21464;&#37327;&#8221;scream&#8220;&#12290;</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#20063;&#23601;&#26159;&#35828;&#20320;&#21487;&#20197;&#20174;scream&#25191;&#34892;shout()</span>

<span style="color: #237fbf; font-weight: bold;">print</span> scream<span style="color: #2f96dc;">()</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">outputs : 'Yes!'</span>


<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#19981;&#27490;&#22914;&#27492;&#65292;&#34429;&#28982;&#21024;&#38500;&#32769;&#30340;&#21517;&#31216;shout&#65292;&#20294;&#26159;&#36890;&#36807;&#21464;&#37327;scream&#20381;&#28982;&#21487;&#20197;&#35843;&#29992;shout&#12290;&#36825;&#26159;&#22240;&#20026;&#20989;&#25968;shout&#30340;</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#24341;&#29992;&#35745;&#25968;&#19981;&#20026;0&#65292;&#25152;&#20197;&#20381;&#28982;&#27809;&#26377;&#22312;&#35299;&#37322;&#22120;&#20013;&#21024;&#38500;&#12290;</span>


<span style="color: #237fbf; font-weight: bold;">del</span> shout
<span style="color: #237fbf; font-weight: bold;">try</span>:
    <span style="color: #237fbf; font-weight: bold;">print</span> shout<span style="color: #2f96dc;">()</span>
<span style="color: #237fbf; font-weight: bold;">except</span> <span style="color: #ce537a; font-weight: bold;">NameError</span>, e:
    <span style="color: #237fbf; font-weight: bold;">print</span> e
    <span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">outputs: "name 'shout' is not defined"</span>

<span style="color: #237fbf; font-weight: bold;">print</span> scream<span style="color: #2f96dc;">()</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">outputs: 'Yes!'</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline10" class="outline-3">
<h3 id="orgheadline10"><span class="section-number-3">2.2</span> 函数可以被定义到一个函数里</h3>
<div class="outline-text-3" id="text-2-2">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">talk</span><span style="color: #2f96dc;">()</span>:

    <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#23450;&#20041;&#20989;&#25968;whisper</span>
    <span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">whisper</span><span style="color: #2f96dc;">(</span>word=<span style="color: #2d9574;">"yes"</span><span style="color: #2f96dc;">)</span>:
        <span style="color: #237fbf; font-weight: bold;">return</span> word.lower<span style="color: #2f96dc;">()</span>+<span style="color: #2d9574;">"..."</span>

    <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#35843;&#29992;whisper&#20989;&#25968;</span>

    <span style="color: #237fbf; font-weight: bold;">print</span> whisper<span style="color: #2f96dc;">()</span>


<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#27599;&#27425;&#20320;&#25191;&#34892; "talk"&#30340;&#26102;&#20505;, "whisper"&#27599;&#27425;&#37117;&#20250;&#34987;&#23450;&#20041;.&#28982;&#21518;&#34987;talk&#25191;&#34892;.</span>
talk<span style="color: #2f96dc;">()</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">outputs: </span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">"yes..."</span>


<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#20294;&#26159; "whisper" &#22312;"talk"&#20043;&#22806;&#19981;&#23384;&#22312;</span>
<span style="color: #237fbf; font-weight: bold;">try</span>:
    <span style="color: #237fbf; font-weight: bold;">print</span> whisper<span style="color: #2f96dc;">()</span>
<span style="color: #237fbf; font-weight: bold;">except</span> <span style="color: #ce537a; font-weight: bold;">NameError</span>, e:
    <span style="color: #237fbf; font-weight: bold;">print</span> e
    <span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">outputs : "name 'whisper' is not defined"*</span>
    Python<span style="color: #2d9574;">'s functions are objects</span>
</pre>
</div>

<p>
从上面的两个例子可以知道,functions 是objects 因为函数：
</p>
<ul class="org-ul">
<li>能赋值给一个变量</li>
<li>能定义在其他的函数中间。</li>
</ul>
</div>
</div>
