python/base/python的函数和对象.org
** 函数可以返回一个函数

#+BEGIN_SRC python

  def getTalk(kind="shout"):


      def shout(word="yes"):
          return word.capitalize()+"!"

      def whisper(word="yes") :
          return word.lower()+"...";

      # 返回其中任意一个
      if kind == "shout":
          # 我们不使用"()",所以不执行函数.仅仅返回 函数对象
          return shout  
      else:
          return whisper

 
  # 得到这个函数,赋值给一个变量
  talk = getTalk()      

  # 打印的话 你会发现返回的是一个fuction object 
  
  print talk
  #outputs : <function shout at 0xb7ea817c>

  # The object is the one returned by the function:
  print talk()
  #outputs : Yes!

  # And you can even use it directly if you feel wild:
  print getTalk("whisper")()
  #outputs : yes...
#+END_SRC

** 函数作为一个参数

#+BEGIN_SRC python
  def doSomethingBefore(func): 
      print "I do something before then I call the function you gave me"
      print func()

  doSomethingBefore(scream)
  #outputs: 
  #I do something before then I call the function you gave me
  #Yes!
#+END_SRC


到这里,函数的内容基本上就讲完了,下面我要开始装饰器了,做好准备了没.



*  function 和 method
以后再说
*  function 和 decorator
上面的部分 <function 和 object> ,是装饰器的基础.当然默认你已经可以理解闭包,作用域等,不懂其实下面的代码也能看懂.那么我们就开始下面的内容了.


你应该知道，装饰器就是一个“wrappers“，意味着它可以在function前后进行执行而不用改变函数。

** 自制一个装饰器
#+BEGIN_SRC python 
  # 装饰器是一个用其他函数作为参数的函数
  def my_shiny_new_decorator(a_function_to_decorate):


      # 在函数内部定义一个wrapper,用来包裹被装饰的函数.因为它可以在被装饰函数的前后执行
      def the_wrapper_around_the_original_function():

          # 在这里放上被装饰函数调用前的代码
          print "Before the function runs"

          # 调用被装饰函数
          a_function_to_decorate()


          # 在被装饰函数执行之后执行
          print "After the function runs"

      # 前面的代码,根本没有执行被装饰的函数,因为前面仅仅是对于"wrapper"进行了定义
      return the_wrapper_around_the_original_function

  # 定义一个你以后不会更改的函数
  def a_stand_alone_function():
      print "I am a stand alone function, don't you dare modify me"

  a_stand_alone_function() 
  #outputs: I am a stand alone function, don't you dare modify me

  # Well, 你可以装饰这个函数来扩展它的作用. 通过传递它给装饰器, 装饰器将会动态的添加代码并且返回一个你想使用的函数.

  a_stand_alone_function_decorated = my_shiny_new_decorator(a_stand_alone_function)
  a_stand_alone_function_decorated()
  #outputs:
  #Before the function runs
  #I am a stand alone function, don't you dare modify me
  #After the function runs
#+END_SRC


如果你想每一次你调用  a_stand_alone_function, a_stand_alone_function_decorated 也被调用. 这也非常简单,只要将 a_stand_alone_function 用
my_shiny_new_decorator 进行重写就可以了


#+BEGIN_EXAMPLE
  a_stand_alone_function = my_shiny_new_decorator(a_stand_alone_function)
  a_stand_alone_function()
  #outputs:
  #Before the function runs
  #I am a stand alone function, don't you dare modify me
  #After the function runs

  # And guess what? That’s EXACTLY what decorators do!
#+END_EXAMPLE

