python/base/python的函数和对象.html

<div id="outline-container-orgheadline11" class="outline-3">
<h3 id="orgheadline11"><span class="section-number-3">2.3</span> 函数可以返回一个函数</h3>
<div class="outline-text-3" id="text-2-3">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">getTalk</span><span style="color: #2f96dc;">(</span>kind=<span style="color: #2d9574;">"shout"</span><span style="color: #2f96dc;">)</span>:


    <span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">shout</span><span style="color: #2f96dc;">(</span>word=<span style="color: #2d9574;">"yes"</span><span style="color: #2f96dc;">)</span>:
        <span style="color: #237fbf; font-weight: bold;">return</span> word.capitalize<span style="color: #2f96dc;">()</span>+<span style="color: #2d9574;">"!"</span>

    <span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">whisper</span><span style="color: #2f96dc;">(</span>word=<span style="color: #2d9574;">"yes"</span><span style="color: #2f96dc;">)</span> :
        <span style="color: #237fbf; font-weight: bold;">return</span> word.lower<span style="color: #2f96dc;">()</span>+<span style="color: #2d9574;">"..."</span>;

    <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#36820;&#22238;&#20854;&#20013;&#20219;&#24847;&#19968;&#20010;</span>
    <span style="color: #237fbf; font-weight: bold;">if</span> kind == <span style="color: #2d9574;">"shout"</span>:
        <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#25105;&#20204;&#19981;&#20351;&#29992;"()",&#25152;&#20197;&#19981;&#25191;&#34892;&#20989;&#25968;.&#20165;&#20165;&#36820;&#22238; &#20989;&#25968;&#23545;&#35937;</span>
        <span style="color: #237fbf; font-weight: bold;">return</span> shout  
    <span style="color: #237fbf; font-weight: bold;">else</span>:
        <span style="color: #237fbf; font-weight: bold;">return</span> whisper


<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#24471;&#21040;&#36825;&#20010;&#20989;&#25968;,&#36171;&#20540;&#32473;&#19968;&#20010;&#21464;&#37327;</span>
<span style="color: #7590db;">talk</span> = getTalk<span style="color: #2f96dc;">()</span>      

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#25171;&#21360;&#30340;&#35805; &#20320;&#20250;&#21457;&#29616;&#36820;&#22238;&#30340;&#26159;&#19968;&#20010;fuction object </span>

<span style="color: #237fbf; font-weight: bold;">print</span> talk
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">outputs : &lt;function shout at 0xb7ea817c&gt;</span>

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">The object is the one returned by the function:</span>
<span style="color: #237fbf; font-weight: bold;">print</span> talk<span style="color: #2f96dc;">()</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">outputs : Yes!</span>

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">And you can even use it directly if you feel wild:</span>
<span style="color: #237fbf; font-weight: bold;">print</span> getTalk<span style="color: #2f96dc;">(</span><span style="color: #2d9574;">"whisper"</span><span style="color: #2f96dc;">)()</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">outputs : yes...</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline12" class="outline-3">
<h3 id="orgheadline12"><span class="section-number-3">2.4</span> 函数作为一个参数</h3>
<div class="outline-text-3" id="text-2-4">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">doSomethingBefore</span><span style="color: #2f96dc;">(</span>func<span style="color: #2f96dc;">)</span>: 
    <span style="color: #237fbf; font-weight: bold;">print</span> <span style="color: #2d9574;">"I do something before then I call the function you gave me"</span>
    <span style="color: #237fbf; font-weight: bold;">print</span> func<span style="color: #2f96dc;">()</span>

doSomethingBefore<span style="color: #2f96dc;">(</span>scream<span style="color: #2f96dc;">)</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">outputs: </span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">I do something before then I call the function you gave me</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">Yes!</span>
</pre>
</div>


<p>
到这里,函数的内容基本上就讲完了,下面我要开始装饰器了,做好准备了没.
</p>
</div>
</div>
</div>



<div id="outline-container-orgheadline14" class="outline-2">
<h2 id="orgheadline14"><span class="section-number-2">3</span> function 和 method</h2>
<div class="outline-text-2" id="text-3">
<p>
以后再说
</p>
</div>
</div>
<div id="outline-container-orgheadline17" class="outline-2">
<h2 id="orgheadline17"><span class="section-number-2">4</span> function 和 decorator</h2>
<div class="outline-text-2" id="text-4">
<p>
上面的部分 &lt;function 和 object&gt; ,是装饰器的基础.当然默认你已经可以理解闭包,作用域等,不懂其实下面的代码也能看懂.那么我们就开始下面的内容了.
</p>


<p>
你应该知道，装饰器就是一个“wrappers“，意味着它可以在function前后进行执行而不用改变函数。
</p>
</div>

<div id="outline-container-orgheadline15" class="outline-3">
<h3 id="orgheadline15"><span class="section-number-3">4.1</span> 自制一个装饰器</h3>
<div class="outline-text-3" id="text-4-1">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#35013;&#39280;&#22120;&#26159;&#19968;&#20010;&#29992;&#20854;&#20182;&#20989;&#25968;&#20316;&#20026;&#21442;&#25968;&#30340;&#20989;&#25968;</span>
<span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">my_shiny_new_decorator</span><span style="color: #2f96dc;">(</span>a_function_to_decorate<span style="color: #2f96dc;">)</span>:


    <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#22312;&#20989;&#25968;&#20869;&#37096;&#23450;&#20041;&#19968;&#20010;wrapper,&#29992;&#26469;&#21253;&#35065;&#34987;&#35013;&#39280;&#30340;&#20989;&#25968;.&#22240;&#20026;&#23427;&#21487;&#20197;&#22312;&#34987;&#35013;&#39280;&#20989;&#25968;&#30340;&#21069;&#21518;&#25191;&#34892;</span>
    <span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">the_wrapper_around_the_original_function</span><span style="color: #2f96dc;">()</span>:

        <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#22312;&#36825;&#37324;&#25918;&#19978;&#34987;&#35013;&#39280;&#20989;&#25968;&#35843;&#29992;&#21069;&#30340;&#20195;&#30721;</span>
        <span style="color: #237fbf; font-weight: bold;">print</span> <span style="color: #2d9574;">"Before the function runs"</span>

        <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#35843;&#29992;&#34987;&#35013;&#39280;&#20989;&#25968;</span>
        a_function_to_decorate<span style="color: #2f96dc;">()</span>


        <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#22312;&#34987;&#35013;&#39280;&#20989;&#25968;&#25191;&#34892;&#20043;&#21518;&#25191;&#34892;</span>
        <span style="color: #237fbf; font-weight: bold;">print</span> <span style="color: #2d9574;">"After the function runs"</span>

    <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#21069;&#38754;&#30340;&#20195;&#30721;,&#26681;&#26412;&#27809;&#26377;&#25191;&#34892;&#34987;&#35013;&#39280;&#30340;&#20989;&#25968;,&#22240;&#20026;&#21069;&#38754;&#20165;&#20165;&#26159;&#23545;&#20110;"wrapper"&#36827;&#34892;&#20102;&#23450;&#20041;</span>
    <span style="color: #237fbf; font-weight: bold;">return</span> the_wrapper_around_the_original_function

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#23450;&#20041;&#19968;&#20010;&#20320;&#20197;&#21518;&#19981;&#20250;&#26356;&#25913;&#30340;&#20989;&#25968;</span>
<span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">a_stand_alone_function</span><span style="color: #2f96dc;">()</span>:
    <span style="color: #237fbf; font-weight: bold;">print</span> <span style="color: #2d9574;">"I am a stand alone function, don't you dare modify me"</span>

a_stand_alone_function<span style="color: #2f96dc;">()</span> 
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">outputs: I am a stand alone function, don't you dare modify me</span>

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Well, &#20320;&#21487;&#20197;&#35013;&#39280;&#36825;&#20010;&#20989;&#25968;&#26469;&#25193;&#23637;&#23427;&#30340;&#20316;&#29992;. &#36890;&#36807;&#20256;&#36882;&#23427;&#32473;&#35013;&#39280;&#22120;, &#35013;&#39280;&#22120;&#23558;&#20250;&#21160;&#24577;&#30340;&#28155;&#21152;&#20195;&#30721;&#24182;&#19988;&#36820;&#22238;&#19968;&#20010;&#20320;&#24819;&#20351;&#29992;&#30340;&#20989;&#25968;.</span>

<span style="color: #7590db;">a_stand_alone_function_decorated</span> = my_shiny_new_decorator<span style="color: #2f96dc;">(</span>a_stand_alone_function<span style="color: #2f96dc;">)</span>
a_stand_alone_function_decorated<span style="color: #2f96dc;">()</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">outputs:</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">Before the function runs</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">I am a stand alone function, don't you dare modify me</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">After the function runs</span>
</pre>
</div>


<p>
如果你想每一次你调用  a_stand_alone_function, a_stand_alone_function_decorated 也被调用. 这也非常简单,只要将 a_stand_alone_function 用
my_shiny_new_decorator 进行重写就可以了
</p>


<pre class="example">
a_stand_alone_function = my_shiny_new_decorator(a_stand_alone_function)
a_stand_alone_function()
#outputs:
#Before the function runs
#I am a stand alone function, don't you dare modify me
#After the function runs

# And guess what? That’s EXACTLY what decorators do!
</pre>
</div>
</div>
