python/base/python的函数和对象.org
** 解开Decorators的神秘面纱

紧接上面的例子,我们可以使用更加简介的decorator格式 :

#+BEGIN_SRC python 
  @my_shiny_new_decorator
  def another_stand_alone_function():
      print "Leave me alone"

  another_stand_alone_function()  
  #outputs:  
  #Before the function runs
  #Leave me alone
  #After the function runs
#+END_SRC

是不是很简单,@decorator 是其实就是下面的简写:

#+BEGIN_SRC python
  another_stand_alone_function = my_shiny_new_decorator(another_stand_alone_function)
#+END_SRC

Decorators 是 [[http://en.wikipedia.org/wiki/Decorator_pattern][decorator design pattern]] 的一种很 pyhonic的写法.在python中有很多经典的设计来简化程序开发(例如:迭代器)

当然了你可以累计使用多个迭代器
#+BEGIN_SRC python 
  def bread(func):
      def wrapper():
          print "</''''''\>"
          func()
          print "<\______/>"
      return wrapper

  def ingredients(func):
      def wrapper():
          print "#tomatoes#"
          func()
          print "~salad~"
      return wrapper
p
  def sandwich(food="--ham--"):
      print food

  sandwich()
  #outputs: --ham--
  sandwich = bread(ingredients(sandwich))
  sandwich()
  #outputs:
  #</''''''\>
  # #tomatoes#
  # --ham--
  # ~salad~
  #<\______/>
#+END_SRC

换做使用python的decorator 语法
#+BEGIN_SRC python
  @bread
  @ingredients
  def sandwich(food="--ham--"):
      print food

  sandwich()
  #outputs:
  #</''''''\>
  # #tomatoes#
  # --ham--
  # ~salad~
  #<\______/>
#+END_SRC

在使用迭代器的时候,你设置的装饰器的顺序也是非常的 *重要*:
#+BEGIN_SRC python
  @ingredients
  @bread
  def strange_sandwich(food="--ham--"):
      print food

  strange_sandwich()
  #outputs:
  ##tomatoes#
  #</''''''\>
  # --ham--
  #<\______/>
  # ~salad~
#+END_SRC

* 装饰器进阶

传递参数到被装饰的函数(decorated function)

#+BEGIN_SRC python 

  # 下面的这个可不是黑科技,<surface book才是> ,它只是让 wrapper 传递了函数的参数

  def a_decorator_passing_arguments(function_to_decorate):
      def a_wrapper_accepting_arguments(arg1, arg2):
          print "I got args! Look:", arg1, arg2
          function_to_decorate(arg1, arg2)
      return a_wrapper_accepting_arguments


  # 当你调用被装饰的函数,实质是你当你调用wrapper时,wrapper可以传递它的参数给被调用的函数.
  @a_decorator_passing_arguments
  def print_full_name(first_name, last_name):
      print "My name is", first_name, last_name

  print_full_name("Peter", "Venkman")
  # outputs:
  #I got args! Look: Peter Venkman
  #My name is Peter Venkman
#+END_SRC

