python/base/python的函数和对象.html

<div id="outline-container-orgheadline16" class="outline-3">
<h3 id="orgheadline16"><span class="section-number-3">4.2</span> 解开Decorators的神秘面纱</h3>
<div class="outline-text-3" id="text-4-2">
<p>
紧接上面的例子,我们可以使用更加简介的decorator格式 :
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #ce537a; font-weight: bold;">@my_shiny_new_decorator</span>
<span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">another_stand_alone_function</span><span style="color: #2f96dc;">()</span>:
    <span style="color: #237fbf; font-weight: bold;">print</span> <span style="color: #2d9574;">"Leave me alone"</span>

another_stand_alone_function<span style="color: #2f96dc;">()</span>  
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">outputs:  </span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">Before the function runs</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">Leave me alone</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">After the function runs</span>
</pre>
</div>

<p>
是不是很简单,@decorator 是其实就是下面的简写:
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #7590db;">another_stand_alone_function</span> = my_shiny_new_decorator<span style="color: #2f96dc;">(</span>another_stand_alone_function<span style="color: #2f96dc;">)</span>
</pre>
</div>

<p>
Decorators 是 <a href="http://en.wikipedia.org/wiki/Decorator_pattern">decorator design pattern</a> 的一种很 pyhonic的写法.在python中有很多经典的设计来简化程序开发(例如:迭代器)
</p>

<p>
当然了你可以累计使用多个迭代器
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">bread</span><span style="color: #2f96dc;">(</span>func<span style="color: #2f96dc;">)</span>:
    <span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">wrapper</span><span style="color: #2f96dc;">()</span>:
        <span style="color: #237fbf; font-weight: bold;">print</span> <span style="color: #2d9574;">"&lt;/''''''\&gt;"</span>
        func<span style="color: #2f96dc;">()</span>
        <span style="color: #237fbf; font-weight: bold;">print</span> <span style="color: #2d9574;">"&lt;\______/&gt;"</span>
    <span style="color: #237fbf; font-weight: bold;">return</span> wrapper

<span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">ingredients</span><span style="color: #2f96dc;">(</span>func<span style="color: #2f96dc;">)</span>:
    <span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">wrapper</span><span style="color: #2f96dc;">()</span>:
        <span style="color: #237fbf; font-weight: bold;">print</span> <span style="color: #2d9574;">"#tomatoes#"</span>
        func<span style="color: #2f96dc;">()</span>
        <span style="color: #237fbf; font-weight: bold;">print</span> <span style="color: #2d9574;">"~salad~"</span>
    <span style="color: #237fbf; font-weight: bold;">return</span> wrapper

<span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">sandwich</span><span style="color: #2f96dc;">(</span>food=<span style="color: #2d9574;">"--ham--"</span><span style="color: #2f96dc;">)</span>:
    <span style="color: #237fbf; font-weight: bold;">print</span> food

sandwich<span style="color: #2f96dc;">()</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">outputs: --ham--</span>
<span style="color: #7590db;">sandwich</span> = bread<span style="color: #2f96dc;">(</span>ingredients<span style="color: #bc6ec5;">(</span>sandwich<span style="color: #bc6ec5;">)</span><span style="color: #2f96dc;">)</span>
sandwich<span style="color: #2f96dc;">()</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">outputs:</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&lt;/''''''\&gt;</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">#tomatoes#</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">--ham--</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">~salad~</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&lt;\______/&gt;</span>
</pre>
</div>

<p>
换做使用python的decorator 语法
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #ce537a; font-weight: bold;">@bread</span>
<span style="color: #ce537a; font-weight: bold;">@ingredients</span>
<span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">sandwich</span><span style="color: #2f96dc;">(</span>food=<span style="color: #2d9574;">"--ham--"</span><span style="color: #2f96dc;">)</span>:
    <span style="color: #237fbf; font-weight: bold;">print</span> food

sandwich<span style="color: #2f96dc;">()</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">outputs:</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&lt;/''''''\&gt;</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">#tomatoes#</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">--ham--</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">~salad~</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&lt;\______/&gt;</span>
</pre>
</div>

<p>
在使用迭代器的时候,你设置的装饰器的顺序也是非常的 <b>重要</b>:
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #ce537a; font-weight: bold;">@ingredients</span>
<span style="color: #ce537a; font-weight: bold;">@bread</span>
<span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">strange_sandwich</span><span style="color: #2f96dc;">(</span>food=<span style="color: #2d9574;">"--ham--"</span><span style="color: #2f96dc;">)</span>:
    <span style="color: #237fbf; font-weight: bold;">print</span> food

strange_sandwich<span style="color: #2f96dc;">()</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">outputs:</span>
<span style="color: #2aa1ae; background-color: #292e34;">##</span><span style="color: #2aa1ae; background-color: #292e34;">tomatoes#</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&lt;/''''''\&gt;</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">--ham--</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&lt;\______/&gt;</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">~salad~</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgheadline23" class="outline-2">
<h2 id="orgheadline23"><span class="section-number-2">5</span> 装饰器进阶</h2>
<div class="outline-text-2" id="text-5">
<p>
传递参数到被装饰的函数(decorated function)
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#19979;&#38754;&#30340;&#36825;&#20010;&#21487;&#19981;&#26159;&#40657;&#31185;&#25216;,&lt;surface book&#25165;&#26159;&gt; ,&#23427;&#21482;&#26159;&#35753; wrapper &#20256;&#36882;&#20102;&#20989;&#25968;&#30340;&#21442;&#25968;</span>

<span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">a_decorator_passing_arguments</span><span style="color: #2f96dc;">(</span>function_to_decorate<span style="color: #2f96dc;">)</span>:
    <span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">a_wrapper_accepting_arguments</span><span style="color: #2f96dc;">(</span>arg1, arg2<span style="color: #2f96dc;">)</span>:
        <span style="color: #237fbf; font-weight: bold;">print</span> <span style="color: #2d9574;">"I got args! Look:"</span>, arg1, arg2
        function_to_decorate<span style="color: #2f96dc;">(</span>arg1, arg2<span style="color: #2f96dc;">)</span>
    <span style="color: #237fbf; font-weight: bold;">return</span> a_wrapper_accepting_arguments


<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#24403;&#20320;&#35843;&#29992;&#34987;&#35013;&#39280;&#30340;&#20989;&#25968;,&#23454;&#36136;&#26159;&#20320;&#24403;&#20320;&#35843;&#29992;wrapper&#26102;,wrapper&#21487;&#20197;&#20256;&#36882;&#23427;&#30340;&#21442;&#25968;&#32473;&#34987;&#35843;&#29992;&#30340;&#20989;&#25968;.</span>
<span style="color: #ce537a; font-weight: bold;">@a_decorator_passing_arguments</span>
<span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">print_full_name</span><span style="color: #2f96dc;">(</span>first_name, last_name<span style="color: #2f96dc;">)</span>:
    <span style="color: #237fbf; font-weight: bold;">print</span> <span style="color: #2d9574;">"My name is"</span>, first_name, last_name

print_full_name<span style="color: #2f96dc;">(</span><span style="color: #2d9574;">"Peter"</span>, <span style="color: #2d9574;">"Venkman"</span><span style="color: #2f96dc;">)</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">outputs:</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">I got args! Look: Peter Venkman</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">My name is Peter Venkman</span>
</pre>
</div>
</div>
