python/base/python的函数和对象.org
** 装饰方法
python中一个很有趣的是事情:方法(methods) 和 function 是相同的. 唯一不同的是方法(methods)期望他们的第一个参数是当前对象自身(self)

这意味着你可以使用相同的方法为一个方法(methods)建立一个装饰器.记得将self写入条件(consideration)中

#+BEGIN_SRC python
  def method_friendly_decorator(method_to_decorate):
      def wrapper(self, lie):
          lie = lie - 3 # very friendly, decrease age even more :-)
          return method_to_decorate(self, lie)
      return wrapper


  class Lucy(object):

      def __init__(self):
          self.age = 32

      @method_friendly_decorator
      def sayYourAge(self, lie):
          print "I am %s, what did you think?" % (self.age + lie)

  l = Lucy()
  l.sayYourAge(-3)
  #outputs: I am 26, what did you think?
#+END_SRC

如果你想制作一个常规目的的decorator,一个你想应用到任意的function或者方法(methods),不用关心参数. 那么使用 *args, **kwargs:
#+BEGIN_SRC python 
  def a_decorator_passing_arbitrary_arguments(function_to_decorate):
      # The wrapper accepts any arguments
      def a_wrapper_accepting_arbitrary_arguments(*args, **kwargs):
          print "Do I have args?:"
          print args
          print kwargs
          # Then you unpack the arguments, here *args, **kwargs
          # If you are not familiar with unpacking, check:
          # http://www.saltycrane.com/blog/2008/01/how-to-use-args-and-kwargs-in-python/
          function_to_decorate(*args, **kwargs)
      return a_wrapper_accepting_arbitrary_arguments

  @a_decorator_passing_arbitrary_arguments
  def function_with_no_argument():
      print "Python is cool, no argument here."

  function_with_no_argument()
  #outputs
  #Do I have args?:
  #()
  #{}
  #Python is cool, no argument here.

  @a_decorator_passing_arbitrary_arguments
  def function_with_arguments(a, b, c):
      print a, b, c

  function_with_arguments(1,2,3)
  #outputs
  #Do I have args?:
  #(1, 2, 3)
  #{}
  #1 2 3 

  @a_decorator_passing_arbitrary_arguments
  def function_with_named_arguments(a, b, c, platypus="Why not ?"):
      print "Do %s, %s and %s like platypus? %s" %\
      (a, b, c, platypus)

  function_with_named_arguments("Bill", "Linus", "Steve", platypus="Indeed!")
  #outputs
  #Do I have args ? :
  #('Bill', 'Linus', 'Steve')
  #{'platypus': 'Indeed!'}
  #Do Bill, Linus and Steve like platypus? Indeed!

  class Mary(object):

      def __init__(self):
          self.age = 31

      @a_decorator_passing_arbitrary_arguments
      def sayYourAge(self, lie=-3): # You can now add a default value
          print "I am %s, what did you think ?" % (self.age + lie)

  m = Mary()
  m.sayYourAge()
  #outputs
  # Do I have args?:
  #(<__main__.Mary object at 0xb7d303ac>,)
  #{}
  #I am 28, what did you think?
#+END_SRC

