python/base/python的函数和对象.html

<div id="outline-container-orgheadline18" class="outline-3">
<h3 id="orgheadline18"><span class="section-number-3">5.1</span> 装饰方法</h3>
<div class="outline-text-3" id="text-5-1">
<p>
python中一个很有趣的是事情:方法(methods) 和 function 是相同的. 唯一不同的是方法(methods)期望他们的第一个参数是当前对象自身(self)
</p>

<p>
这意味着你可以使用相同的方法为一个方法(methods)建立一个装饰器.记得将self写入条件(consideration)中
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">method_friendly_decorator</span><span style="color: #2f96dc;">(</span>method_to_decorate<span style="color: #2f96dc;">)</span>:
    <span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">wrapper</span><span style="color: #2f96dc;">(</span><span style="color: #237fbf; font-weight: bold;">self</span>, lie<span style="color: #2f96dc;">)</span>:
        <span style="color: #7590db;">lie</span> = lie - <span style="color: #a45bad;">3</span> <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">very friendly, decrease age even more :-)</span>
        <span style="color: #237fbf; font-weight: bold;">return</span> method_to_decorate<span style="color: #2f96dc;">(</span><span style="color: #237fbf; font-weight: bold;">self</span>, lie<span style="color: #2f96dc;">)</span>
    <span style="color: #237fbf; font-weight: bold;">return</span> wrapper


<span style="color: #237fbf; font-weight: bold;">class</span> <span style="color: #ce537a; font-weight: bold;">Lucy</span><span style="color: #2f96dc;">(</span><span style="color: #1f71ab;">object</span><span style="color: #2f96dc;">)</span>:

    <span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">__init__</span><span style="color: #2f96dc;">(</span><span style="color: #237fbf; font-weight: bold;">self</span><span style="color: #2f96dc;">)</span>:
        <span style="color: #237fbf; font-weight: bold;">self</span>.age = <span style="color: #a45bad;">32</span>

    <span style="color: #ce537a; font-weight: bold;">@method_friendly_decorator</span>
    <span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">sayYourAge</span><span style="color: #2f96dc;">(</span><span style="color: #237fbf; font-weight: bold;">self</span>, lie<span style="color: #2f96dc;">)</span>:
        <span style="color: #237fbf; font-weight: bold;">print</span> <span style="color: #2d9574;">"I am %s, what did you think?"</span> % <span style="color: #2f96dc;">(</span><span style="color: #237fbf; font-weight: bold;">self</span>.age + lie<span style="color: #2f96dc;">)</span>

<span style="color: #7590db;">l</span> = Lucy<span style="color: #2f96dc;">()</span>
l.sayYourAge<span style="color: #2f96dc;">(</span>-<span style="color: #a45bad;">3</span><span style="color: #2f96dc;">)</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">outputs: I am 26, what did you think?</span>
</pre>
</div>

<p>
如果你想制作一个常规目的的decorator,一个你想应用到任意的function或者方法(methods),不用关心参数. 那么使用 *args, **kwargs:
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">a_decorator_passing_arbitrary_arguments</span><span style="color: #2f96dc;">(</span>function_to_decorate<span style="color: #2f96dc;">)</span>:
    <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">The wrapper accepts any arguments</span>
    <span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">a_wrapper_accepting_arbitrary_arguments</span><span style="color: #2f96dc;">(</span>*args, **kwargs<span style="color: #2f96dc;">)</span>:
        <span style="color: #237fbf; font-weight: bold;">print</span> <span style="color: #2d9574;">"Do I have args?:"</span>
        <span style="color: #237fbf; font-weight: bold;">print</span> args
        <span style="color: #237fbf; font-weight: bold;">print</span> kwargs
        <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Then you unpack the arguments, here *args, **kwargs</span>
        <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">If you are not familiar with unpacking, check:</span>
        <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">http://www.saltycrane.com/blog/2008/01/how-to-use-args-and-kwargs-in-python/</span>
        function_to_decorate<span style="color: #2f96dc;">(</span>*args, **kwargs<span style="color: #2f96dc;">)</span>
    <span style="color: #237fbf; font-weight: bold;">return</span> a_wrapper_accepting_arbitrary_arguments

<span style="color: #ce537a; font-weight: bold;">@a_decorator_passing_arbitrary_arguments</span>
<span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">function_with_no_argument</span><span style="color: #2f96dc;">()</span>:
    <span style="color: #237fbf; font-weight: bold;">print</span> <span style="color: #2d9574;">"Python is cool, no argument here."</span>

function_with_no_argument<span style="color: #2f96dc;">()</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">outputs</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">Do I have args?:</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">()</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">{}</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">Python is cool, no argument here.</span>

<span style="color: #ce537a; font-weight: bold;">@a_decorator_passing_arbitrary_arguments</span>
<span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">function_with_arguments</span><span style="color: #2f96dc;">(</span>a, b, c<span style="color: #2f96dc;">)</span>:
    <span style="color: #237fbf; font-weight: bold;">print</span> a, b, c

function_with_arguments<span style="color: #2f96dc;">(</span><span style="color: #a45bad;">1</span>,<span style="color: #a45bad;">2</span>,<span style="color: #a45bad;">3</span><span style="color: #2f96dc;">)</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">outputs</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">Do I have args?:</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">(1, 2, 3)</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">{}</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">1 2 3 </span>

<span style="color: #ce537a; font-weight: bold;">@a_decorator_passing_arbitrary_arguments</span>
<span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">function_with_named_arguments</span><span style="color: #2f96dc;">(</span>a, b, c, platypus=<span style="color: #2d9574;">"Why not ?"</span><span style="color: #2f96dc;">)</span>:
    <span style="color: #237fbf; font-weight: bold;">print</span> <span style="color: #2d9574;">"Do %s, %s and %s like platypus? %s"</span> %\
    <span style="color: #2f96dc;">(</span>a, b, c, platypus<span style="color: #2f96dc;">)</span>

function_with_named_arguments<span style="color: #2f96dc;">(</span><span style="color: #2d9574;">"Bill"</span>, <span style="color: #2d9574;">"Linus"</span>, <span style="color: #2d9574;">"Steve"</span>, platypus=<span style="color: #2d9574;">"Indeed!"</span><span style="color: #2f96dc;">)</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">outputs</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">Do I have args ? :</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">('Bill', 'Linus', 'Steve')</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">{'platypus': 'Indeed!'}</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">Do Bill, Linus and Steve like platypus? Indeed!</span>

<span style="color: #237fbf; font-weight: bold;">class</span> <span style="color: #ce537a; font-weight: bold;">Mary</span><span style="color: #2f96dc;">(</span><span style="color: #1f71ab;">object</span><span style="color: #2f96dc;">)</span>:

    <span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">__init__</span><span style="color: #2f96dc;">(</span><span style="color: #237fbf; font-weight: bold;">self</span><span style="color: #2f96dc;">)</span>:
        <span style="color: #237fbf; font-weight: bold;">self</span>.age = <span style="color: #a45bad;">31</span>

    <span style="color: #ce537a; font-weight: bold;">@a_decorator_passing_arbitrary_arguments</span>
    <span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">sayYourAge</span><span style="color: #2f96dc;">(</span><span style="color: #237fbf; font-weight: bold;">self</span>, lie=-<span style="color: #a45bad;">3</span><span style="color: #2f96dc;">)</span>: <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">You can now add a default value</span>
        <span style="color: #237fbf; font-weight: bold;">print</span> <span style="color: #2d9574;">"I am %s, what did you think ?"</span> % <span style="color: #2f96dc;">(</span><span style="color: #237fbf; font-weight: bold;">self</span>.age + lie<span style="color: #2f96dc;">)</span>

<span style="color: #7590db;">m</span> = Mary<span style="color: #2f96dc;">()</span>
m.sayYourAge<span style="color: #2f96dc;">()</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">outputs</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Do I have args?:</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">(&lt;__main__.Mary object at 0xb7d303ac&gt;,)</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">{}</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">I am 28, what did you think?</span>
</pre>
</div>
</div>
</div>
