python/base/python的函数和对象.org
** 传递参数到decorator
现在你也许会问怎么传递参数给装饰器自身?

这也许有点饶.自从一个装饰器必须接受一个函数作为一个参数.因此,你 *不能* 直接传递 被装饰函数  的参数给 decorator

在解决问题之前,请看以下的提示:
#+BEGIN_SRC python
  # 装饰器是一个普通函数
  # 下面写的这个是返回的"wrapper" 这个function object, 骚年看清楚,看清楚,看清楚....
  def my_decorator(func):
      print "I am an ordinary function"
      def wrapper():
          print "I am function returned by the decorator"
          func()
      return wrapper

  # Therefore, you can call it without any "@"
  # 因此,不使用@ 你可以调用它

  def lazy_function():
      print "zzzzzzzz"

  decorated_function = my_decorator(lazy_function)
  #outputs: I am an ordinary function

  print decorated_funtion
  #outputs:<function wrapper at 0x7f75097b9758>


  # 它打印 "I am an ordinary function", 
  # 虽然调用了my_decorator() ,但是返回的是 fucntion object"wrapper"

  @my_decorator
  def lazy_function():
      print "zzzzzzzz"

  #outputs: I am an ordinary function
#+END_SRC



上面的例子就好像 "my_decorator" 被调用了,所以当你使用 @my_decorator 这个装饰器.
你是告诉python调用带有@my_decorator标志的函数.
This is important! The label you give can point directly to the decorator—or not.
这是非常重要的. 你给的这个标志是直接指向这个 decorator 或者没有.(翻译的真烂,自己看上面的英文吧)

Let’s get evil. (吾心本恶....)
#+BEGIN_SRC python 
  def decorator_maker():

      print "I make decorators! I am executed only once: "+\
            "when you make me create a decorator."

      def my_decorator(func):

          print "I am a decorator! I am executed only when you decorate a function."

          def wrapped():
              print ("I am the wrapper around the decorated function. "
                    "I am called when you call the decorated function. "
                    "As the wrapper, I return the RESULT of the decorated function.")
              return func()

          print "As the decorator, I return the wrapped function."

          return wrapped

      print "As a decorator maker, I return a decorator"
      return my_decorator

  # Let’s create a decorator. It’s just a new function after all.
  # 我们创建了一个 decorator , 它只是新的函数
  new_decorator = decorator_maker()       
  #outputs:
  #I make decorators! I am executed only once: when you make me create a decorator.
  #As a decorator maker, I return a decorator

  # Then we decorate the function
  # 我们继续创建一个迭代的函数

  def decorated_function():
      print "I am the decorated function."

  decorated_function = new_decorator(decorated_function)
  #outputs:
  #I am a decorator! I am executed only when you decorate a function.
  #As the decorator, I return the wrapped function

  # 这个函数是 调用wrapped()的结果.也就是上层my_decorator参数中的func,实例中是 decorated_function()
  decorated_function()
  #outputs:
  #I am the wrapper around the decorated function. I am called when you call the decorated function.
  #As the wrapper, I return the RESULT of the decorated function.
  #I am the decorated function.
#+END_SRC

不要觉得惊讶.让我们继续.

让我们先忽略中间中间的变量(这里指的上面例子那些讨厌的变量复制)来实现相同的事情.

#+BEGIN_SRC python
  def decorated_function():
      print "I am the decorated function."


  decorated_function = decorator_maker()(decorated_function)
  #outputs:
  #I make decorators! I am executed only once: when you make me create a decorator.
  #As a decorator maker, I return a decorator
  #I am a decorator! I am executed only when you decorate a function.
  #As the decorator, I return the wrapped function.

  # Finally:
  decorated_function()    
  #outputs:
  #I am the wrapper around the decorated function. I am called when you call the decorated function.
  #As the wrapper, I return the RESULT of the decorated function.
  #I am the decorated function.
#+END_SRC

我们继续精简:

#+BEGIN_SRC python
  @decorator_maker()
  def decorated_function():
      print "I am the decorated function."
  #outputs:
  #I make decorators! I am executed only once: when you make me create a decorator.
  #As a decorator maker, I return a decorator
  #I am a decorator! I am executed only when you decorate a function.
  #As the decorator, I return the wrapped function.

  #Eventually: 
  decorated_function()    
  #outputs:
  #I am the wrapper around the decorated function. I am called when you call the decorated function.
  #As the wrapper, I return the RESULT of the decorated function.
  #I am the decorated function.
#+END_SRC

看到上面例子中的"@"了么? 我们使用"@"这个函数调用语法

回到如何使用带参数的装饰器.如果我们能够动态的使用函数作为装饰器,那么我们就能传递参数到装饰器中.

#+BEGIN_SRC python
  def decorator_maker_with_arguments(decorator_arg1, decorator_arg2):

      print "I make decorators! And I accept arguments:", decorator_arg1, decorator_arg2

      def my_decorator(func):
          # The ability to pass arguments here is a gift from closures.
          # If you are not comfortable with closures, you can assume it’s ok,
          # or read: http://stackoverflow.com/questions/13857/can-you-explain-closures-as-they-relate-to-python
          print "I am the decorator. Somehow you passed me arguments:", decorator_arg1, decorator_arg2

          # Don't confuse decorator arguments and function arguments!
          def wrapped(function_arg1, function_arg2) :
              print ("I am the wrapper around the decorated function.\n"
                    "I can access all the variables\n"
                    "\t- from the decorator: {0} {1}\n"
                    "\t- from the function call: {2} {3}\n"
                    "Then I can pass them to the decorated function"
                    .format(decorator_arg1, decorator_arg2,
                            function_arg1, function_arg2))
              return func(function_arg1, function_arg2)

          return wrapped

      return my_decorator

  @decorator_maker_with_arguments("Leonard", "Sheldon")
  def decorated_function_with_arguments(function_arg1, function_arg2):
      print ("I am the decorated function and only knows about my arguments: {0}"
             " {1}".format(function_arg1, function_arg2))

  decorated_function_with_arguments("Rajesh", "Howard")
  #outputs:
  #I make decorators! And I accept arguments: Leonard Sheldon
  #I am the decorator. Somehow you passed me arguments: Leonard Sheldon
  #I am the wrapper around the decorated function. 

#+END_SRC

上面实现了带参数的装饰器,另外: 参数也也可以是一个变量

#+BEGIN_SRC python
  c1 = "Penny"
  c2 = "Leslie"

  @decorator_maker_with_arguments("Leonard", c1)
  def decorated_function_with_arguments(function_arg1, function_arg2):
      print ("I am the decorated function and only knows about my arguments:"
             " {0} {1}".format(function_arg1, function_arg2))

  decorated_function_with_arguments(c2, "Howard")
  #outputs:
  #I make decorators! And I accept arguments: Leonard Penny
  #I am the decorator. Somehow you passed me arguments: Leonard Penny
  #I am the wrapper around the decorated function. 
  #I can access all the variables 
  #   - from the decorator: Leonard Penny 
  #   - from the function call: Leslie Howard 
  #Then I can pass them to the decorated function
  #I am the decorated function and only knows about my arguments: Leslie Howard
#+END_SRC

看了上面什么感觉, 你能够传递传递参数给装饰器就像使用了魔法的函数一样(magic function).如果你原因, 你可以使用*args, **kwargs作为参数.
但是你要记住装饰器只能被调用一次.在python 引入(import)这个脚本文件之后,你就不能动态的设置参数了.当你执行"import x"的时候,函数已经被装饰了.你就不能修改任何事情了

