python/base/python的函数和对象.html

<div id="outline-container-orgheadline19" class="outline-3">
<h3 id="orgheadline19"><span class="section-number-3">5.2</span> 传递参数到decorator</h3>
<div class="outline-text-3" id="text-5-2">
<p>
现在你也许会问怎么传递参数给装饰器自身?
</p>

<p>
这也许有点饶.自从一个装饰器必须接受一个函数作为一个参数.因此,你 <b>不能</b> 直接传递 被装饰函数  的参数给 decorator
</p>

<p>
在解决问题之前,请看以下的提示:
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#35013;&#39280;&#22120;&#26159;&#19968;&#20010;&#26222;&#36890;&#20989;&#25968;</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#19979;&#38754;&#20889;&#30340;&#36825;&#20010;&#26159;&#36820;&#22238;&#30340;"wrapper" &#36825;&#20010;function object, &#39578;&#24180;&#30475;&#28165;&#26970;,&#30475;&#28165;&#26970;,&#30475;&#28165;&#26970;....</span>
<span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">my_decorator</span><span style="color: #2f96dc;">(</span>func<span style="color: #2f96dc;">)</span>:
    <span style="color: #237fbf; font-weight: bold;">print</span> <span style="color: #2d9574;">"I am an ordinary function"</span>
    <span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">wrapper</span><span style="color: #2f96dc;">()</span>:
        <span style="color: #237fbf; font-weight: bold;">print</span> <span style="color: #2d9574;">"I am function returned by the decorator"</span>
        func<span style="color: #2f96dc;">()</span>
    <span style="color: #237fbf; font-weight: bold;">return</span> wrapper

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Therefore, you can call it without any "@"</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#22240;&#27492;,&#19981;&#20351;&#29992;@ &#20320;&#21487;&#20197;&#35843;&#29992;&#23427;</span>

<span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">lazy_function</span><span style="color: #2f96dc;">()</span>:
    <span style="color: #237fbf; font-weight: bold;">print</span> <span style="color: #2d9574;">"zzzzzzzz"</span>

<span style="color: #7590db;">decorated_function</span> = my_decorator<span style="color: #2f96dc;">(</span>lazy_function<span style="color: #2f96dc;">)</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">outputs: I am an ordinary function</span>

<span style="color: #237fbf; font-weight: bold;">print</span> decorated_funtion
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">outputs:&lt;function wrapper at 0x7f75097b9758&gt;</span>


<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#23427;&#25171;&#21360; "I am an ordinary function", </span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#34429;&#28982;&#35843;&#29992;&#20102;my_decorator() ,&#20294;&#26159;&#36820;&#22238;&#30340;&#26159; fucntion object"wrapper"</span>

<span style="color: #ce537a; font-weight: bold;">@my_decorator</span>
<span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">lazy_function</span><span style="color: #2f96dc;">()</span>:
    <span style="color: #237fbf; font-weight: bold;">print</span> <span style="color: #2d9574;">"zzzzzzzz"</span>

<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">outputs: I am an ordinary function</span>
</pre>
</div>



<p>
上面的例子就好像 "my_decorator" 被调用了,所以当你使用 @my_decorator 这个装饰器.
你是告诉python调用带有@my_decorator标志的函数.
This is important! The label you give can point directly to the decorator—or not.
这是非常重要的. 你给的这个标志是直接指向这个 decorator 或者没有.(翻译的真烂,自己看上面的英文吧)
</p>

<p>
Let’s get evil. (吾心本恶&#x2026;.)
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">decorator_maker</span><span style="color: #2f96dc;">()</span>:

    <span style="color: #237fbf; font-weight: bold;">print</span> <span style="color: #2d9574;">"I make decorators! I am executed only once: "</span>+\
          <span style="color: #2d9574;">"when you make me create a decorator."</span>

    <span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">my_decorator</span><span style="color: #2f96dc;">(</span>func<span style="color: #2f96dc;">)</span>:

        <span style="color: #237fbf; font-weight: bold;">print</span> <span style="color: #2d9574;">"I am a decorator! I am executed only when you decorate a function."</span>

        <span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">wrapped</span><span style="color: #2f96dc;">()</span>:
            <span style="color: #237fbf; font-weight: bold;">print</span> <span style="color: #2f96dc;">(</span><span style="color: #2d9574;">"I am the wrapper around the decorated function. "</span>
                  <span style="color: #2d9574;">"I am called when you call the decorated function. "</span>
                  <span style="color: #2d9574;">"As the wrapper, I return the RESULT of the decorated function."</span><span style="color: #2f96dc;">)</span>
            <span style="color: #237fbf; font-weight: bold;">return</span> func<span style="color: #2f96dc;">()</span>

        <span style="color: #237fbf; font-weight: bold;">print</span> <span style="color: #2d9574;">"As the decorator, I return the wrapped function."</span>

        <span style="color: #237fbf; font-weight: bold;">return</span> wrapped

    <span style="color: #237fbf; font-weight: bold;">print</span> <span style="color: #2d9574;">"As a decorator maker, I return a decorator"</span>
    <span style="color: #237fbf; font-weight: bold;">return</span> my_decorator

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Let&#8217;s create a decorator. It&#8217;s just a new function after all.</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#25105;&#20204;&#21019;&#24314;&#20102;&#19968;&#20010; decorator , &#23427;&#21482;&#26159;&#26032;&#30340;&#20989;&#25968;</span>
<span style="color: #7590db;">new_decorator</span> = decorator_maker<span style="color: #2f96dc;">()</span>       
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">outputs:</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">I make decorators! I am executed only once: when you make me create a decorator.</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">As a decorator maker, I return a decorator</span>

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Then we decorate the function</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#25105;&#20204;&#32487;&#32493;&#21019;&#24314;&#19968;&#20010;&#36845;&#20195;&#30340;&#20989;&#25968;</span>

<span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">decorated_function</span><span style="color: #2f96dc;">()</span>:
    <span style="color: #237fbf; font-weight: bold;">print</span> <span style="color: #2d9574;">"I am the decorated function."</span>

<span style="color: #7590db;">decorated_function</span> = new_decorator<span style="color: #2f96dc;">(</span>decorated_function<span style="color: #2f96dc;">)</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">outputs:</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">I am a decorator! I am executed only when you decorate a function.</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">As the decorator, I return the wrapped function</span>

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#36825;&#20010;&#20989;&#25968;&#26159; &#35843;&#29992;wrapped()&#30340;&#32467;&#26524;.&#20063;&#23601;&#26159;&#19978;&#23618;my_decorator&#21442;&#25968;&#20013;&#30340;func,&#23454;&#20363;&#20013;&#26159; decorated_function()</span>
decorated_function<span style="color: #2f96dc;">()</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">outputs:</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">I am the wrapper around the decorated function. I am called when you call the decorated function.</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">As the wrapper, I return the RESULT of the decorated function.</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">I am the decorated function.</span>
</pre>
</div>

<p>
不要觉得惊讶.让我们继续.
</p>

<p>
让我们先忽略中间中间的变量(这里指的上面例子那些讨厌的变量复制)来实现相同的事情.
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">decorated_function</span><span style="color: #2f96dc;">()</span>:
    <span style="color: #237fbf; font-weight: bold;">print</span> <span style="color: #2d9574;">"I am the decorated function."</span>


<span style="color: #7590db;">decorated_function</span> = decorator_maker<span style="color: #2f96dc;">()(</span>decorated_function<span style="color: #2f96dc;">)</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">outputs:</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">I make decorators! I am executed only once: when you make me create a decorator.</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">As a decorator maker, I return a decorator</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">I am a decorator! I am executed only when you decorate a function.</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">As the decorator, I return the wrapped function.</span>

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Finally:</span>
decorated_function<span style="color: #2f96dc;">()</span>    
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">outputs:</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">I am the wrapper around the decorated function. I am called when you call the decorated function.</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">As the wrapper, I return the RESULT of the decorated function.</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">I am the decorated function.</span>
</pre>
</div>

<p>
我们继续精简:
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #ce537a; font-weight: bold;">@decorator_maker</span><span style="color: #2f96dc;">()</span>
<span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">decorated_function</span><span style="color: #2f96dc;">()</span>:
    <span style="color: #237fbf; font-weight: bold;">print</span> <span style="color: #2d9574;">"I am the decorated function."</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">outputs:</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">I make decorators! I am executed only once: when you make me create a decorator.</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">As a decorator maker, I return a decorator</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">I am a decorator! I am executed only when you decorate a function.</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">As the decorator, I return the wrapped function.</span>

<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">Eventually: </span>
decorated_function<span style="color: #2f96dc;">()</span>    
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">outputs:</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">I am the wrapper around the decorated function. I am called when you call the decorated function.</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">As the wrapper, I return the RESULT of the decorated function.</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">I am the decorated function.</span>
</pre>
</div>

<p>
看到上面例子中的"@"了么? 我们使用"@"这个函数调用语法
</p>

<p>
回到如何使用带参数的装饰器.如果我们能够动态的使用函数作为装饰器,那么我们就能传递参数到装饰器中.
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">decorator_maker_with_arguments</span><span style="color: #2f96dc;">(</span>decorator_arg1, decorator_arg2<span style="color: #2f96dc;">)</span>:

    <span style="color: #237fbf; font-weight: bold;">print</span> <span style="color: #2d9574;">"I make decorators! And I accept arguments:"</span>, decorator_arg1, decorator_arg2

    <span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">my_decorator</span><span style="color: #2f96dc;">(</span>func<span style="color: #2f96dc;">)</span>:
        <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">The ability to pass arguments here is a gift from closures.</span>
        <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">If you are not comfortable with closures, you can assume it&#8217;s ok,</span>
        <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">or read: http://stackoverflow.com/questions/13857/can-you-explain-closures-as-they-relate-to-python</span>
        <span style="color: #237fbf; font-weight: bold;">print</span> <span style="color: #2d9574;">"I am the decorator. Somehow you passed me arguments:"</span>, decorator_arg1, decorator_arg2

        <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Don't confuse decorator arguments and function arguments!</span>
        <span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">wrapped</span><span style="color: #2f96dc;">(</span>function_arg1, function_arg2<span style="color: #2f96dc;">)</span> :
            <span style="color: #237fbf; font-weight: bold;">print</span> <span style="color: #2f96dc;">(</span><span style="color: #2d9574;">"I am the wrapper around the decorated function.\n"</span>
                  <span style="color: #2d9574;">"I can access all the variables\n"</span>
                  <span style="color: #2d9574;">"\t- from the decorator: {0} {1}\n"</span>
                  <span style="color: #2d9574;">"\t- from the function call: {2} {3}\n"</span>
                  <span style="color: #2d9574;">"Then I can pass them to the decorated function"</span>
                  .<span style="color: #1f71ab;">format</span><span style="color: #bc6ec5;">(</span>decorator_arg1, decorator_arg2,
                          function_arg1, function_arg2<span style="color: #bc6ec5;">)</span><span style="color: #2f96dc;">)</span>
            <span style="color: #237fbf; font-weight: bold;">return</span> func<span style="color: #2f96dc;">(</span>function_arg1, function_arg2<span style="color: #2f96dc;">)</span>

        <span style="color: #237fbf; font-weight: bold;">return</span> wrapped

    <span style="color: #237fbf; font-weight: bold;">return</span> my_decorator

<span style="color: #ce537a; font-weight: bold;">@decorator_maker_with_arguments</span><span style="color: #2f96dc;">(</span><span style="color: #2d9574;">"Leonard"</span>, <span style="color: #2d9574;">"Sheldon"</span><span style="color: #2f96dc;">)</span>
<span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">decorated_function_with_arguments</span><span style="color: #2f96dc;">(</span>function_arg1, function_arg2<span style="color: #2f96dc;">)</span>:
    <span style="color: #237fbf; font-weight: bold;">print</span> <span style="color: #2f96dc;">(</span><span style="color: #2d9574;">"I am the decorated function and only knows about my arguments: {0}"</span>
           <span style="color: #2d9574;">" {1}"</span>.<span style="color: #1f71ab;">format</span><span style="color: #bc6ec5;">(</span>function_arg1, function_arg2<span style="color: #bc6ec5;">)</span><span style="color: #2f96dc;">)</span>

decorated_function_with_arguments<span style="color: #2f96dc;">(</span><span style="color: #2d9574;">"Rajesh"</span>, <span style="color: #2d9574;">"Howard"</span><span style="color: #2f96dc;">)</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">outputs:</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">I make decorators! And I accept arguments: Leonard Sheldon</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">I am the decorator. Somehow you passed me arguments: Leonard Sheldon</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">I am the wrapper around the decorated function.</span>
</pre>
</div>

<p>
上面实现了带参数的装饰器,另外: 参数也也可以是一个变量
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #7590db;">c1</span> = <span style="color: #2d9574;">"Penny"</span>
<span style="color: #7590db;">c2</span> = <span style="color: #2d9574;">"Leslie"</span>

<span style="color: #ce537a; font-weight: bold;">@decorator_maker_with_arguments</span><span style="color: #2f96dc;">(</span><span style="color: #2d9574;">"Leonard"</span>, c1<span style="color: #2f96dc;">)</span>
<span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">decorated_function_with_arguments</span><span style="color: #2f96dc;">(</span>function_arg1, function_arg2<span style="color: #2f96dc;">)</span>:
    <span style="color: #237fbf; font-weight: bold;">print</span> <span style="color: #2f96dc;">(</span><span style="color: #2d9574;">"I am the decorated function and only knows about my arguments:"</span>
           <span style="color: #2d9574;">" {0} {1}"</span>.<span style="color: #1f71ab;">format</span><span style="color: #bc6ec5;">(</span>function_arg1, function_arg2<span style="color: #bc6ec5;">)</span><span style="color: #2f96dc;">)</span>

decorated_function_with_arguments<span style="color: #2f96dc;">(</span>c2, <span style="color: #2d9574;">"Howard"</span><span style="color: #2f96dc;">)</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">outputs:</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">I make decorators! And I accept arguments: Leonard Penny</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">I am the decorator. Somehow you passed me arguments: Leonard Penny</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">I am the wrapper around the decorated function. </span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">I can access all the variables </span>
<span style="color: #2aa1ae; background-color: #292e34;">#   </span><span style="color: #2aa1ae; background-color: #292e34;">- from the decorator: Leonard Penny </span>
<span style="color: #2aa1ae; background-color: #292e34;">#   </span><span style="color: #2aa1ae; background-color: #292e34;">- from the function call: Leslie Howard </span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">Then I can pass them to the decorated function</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">I am the decorated function and only knows about my arguments: Leslie Howard</span>
</pre>
</div>

<p>
看了上面什么感觉, 你能够传递传递参数给装饰器就像使用了魔法的函数一样(magic function).如果你原因, 你可以使用*args, **kwargs作为参数.
但是你要记住装饰器只能被调用一次.在python 引入(import)这个脚本文件之后,你就不能动态的设置参数了.当你执行"import x"的时候,函数已经被装饰了.你就不能修改任何事情了
</p>
</div>
</div>
