python/base/python的函数和对象.org
** 练习: 装饰一个装饰器
作为练习.我们要写一个能让任何装饰器接收任何参数的代码.为了接受参数,我们另外创建一个函数作为装饰器来实现这段代码.

好好想想,其实并不是很难.
#+BEGIN_SRC python

  def decorator_with_args(decorator_to_enhance):
      """ 
      This function is supposed to be used as a decorator.
      It must decorate an other function, that is intended to be used as a decorator.
      Take a cup of coffee.
      It will allow any decorator to accept an arbitrary number of arguments,
      saving you the headache to remember how to do that every time.
      """

      # We use the same trick we did to pass arguments
      def decorator_maker(*args, **kwargs):

          # We create on the fly a decorator that accepts only a function
          # but keeps the passed arguments from the maker.
          def decorator_wrapper(func):

              # We return the result of the original decorator, which, after all, 
              # IS JUST AN ORDINARY FUNCTION (which returns a function).
              # Only pitfall: the decorator must have this specific signature or it won't work:
              return decorator_to_enhance(func, *args, **kwargs)

          return decorator_wrapper

      return decorator_maker
#+END_SRC

接下来
#+BEGIN_SRC python
  # You create the function you will use as a decorator. And stick a decorator on it :-)
  # Don't forget, the signature is "decorator(func, *args, **kwargs)"
  @decorator_with_args 
  def decorated_decorator(func, *args, **kwargs): 
      def wrapper(function_arg1, function_arg2):
          print "Decorated with", args, kwargs
          return func(function_arg1, function_arg2)
      return wrapper

  # Then you decorate the functions you wish with your brand new decorated decorator.

  @decorated_decorator(42, 404, 1024)
  def decorated_function(function_arg1, function_arg2):
      print "Hello", function_arg1, function_arg2

  decorated_function("Universe and", "everything")
  #outputs:
  #Decorated with (42, 404, 1024) {}
  #Hello Universe and everything

  # Whoooot!
#+END_SRC

I know, the last time you had this feeling, it was after listening a guy saying: "before understanding recursion, you must first understand recursion". But now, don't you feel good about mastering this?
不知道上面那段话怎么翻译.

** 最好的实践: 装饰器
请锦记下面几点:
+ 迭代器在 Python 2.4 之后被引入,因为你的python环境必须在python2.4之上.
+ 装饰器会降低函数调用,记在心里
+ 函数(这个指的是被装饰的函数)不能单独运行.如果这个函数被装饰了,所有的代码就被装饰了.你不能之运行这个函数而不运行装饰器.
+ 装饰器包裹了函数,使得函数的debug比较困难.(在python2.5之后好了很多,下面的functools.wraps()解决了这点)

 *functools* module 在python2.5中被引入,它内置的 "functools.wraps()"可以复制被装饰函数的name, module, and docstring 到 wrapper中.

(号外: *functools.wraps()也是一个装饰器)

#+BEGIN_SRC python
  # For debugging, the stacktrace prints you the function __name__
  def foo():
      print "foo"

  print foo.__name__
  #outputs: foo

  # With a decorator, it gets messy    
  def bar(func):
      def wrapper():
          print "bar"
          return func()
      return wrapper

  @bar
  def foo():
      print "foo"

  print foo.__name__
  #outputs: wrapper

  # "functools" can help for that

  import functools

  def bar(func):
      # We say that "wrapper", is wrapping "func"
      # and the magic begins
      @functools.wraps(func)
      def wrapper():
          print "bar"
          return func()
      return wrapper

  @bar
  def foo():
      print "foo"

  print foo.__name__
  #outputs: foo
#+END_SRC

** 如何理解装饰器的执行步骤.
#+BEGIN_SRC python 

#+END_SRC

* 装饰器的用处

