python/base/python的函数和对象.html

<div id="outline-container-orgheadline20" class="outline-3">
<h3 id="orgheadline20"><span class="section-number-3">5.3</span> 练习: 装饰一个装饰器</h3>
<div class="outline-text-3" id="text-5-3">
<p>
作为练习.我们要写一个能让任何装饰器接收任何参数的代码.为了接受参数,我们另外创建一个函数作为装饰器来实现这段代码.
</p>

<p>
好好想想,其实并不是很难.
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">decorator_with_args</span><span style="color: #2f96dc;">(</span>decorator_to_enhance<span style="color: #2f96dc;">)</span>:
    <span style="color: #2d9574;">""" </span>
<span style="color: #2d9574;">    This function is supposed to be used as a decorator.</span>
<span style="color: #2d9574;">    It must decorate an other function, that is intended to be used as a decorator.</span>
<span style="color: #2d9574;">    Take a cup of coffee.</span>
<span style="color: #2d9574;">    It will allow any decorator to accept an arbitrary number of arguments,</span>
<span style="color: #2d9574;">    saving you the headache to remember how to do that every time.</span>
<span style="color: #2d9574;">    """</span>

    <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">We use the same trick we did to pass arguments</span>
    <span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">decorator_maker</span><span style="color: #2f96dc;">(</span>*args, **kwargs<span style="color: #2f96dc;">)</span>:

        <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">We create on the fly a decorator that accepts only a function</span>
        <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">but keeps the passed arguments from the maker.</span>
        <span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">decorator_wrapper</span><span style="color: #2f96dc;">(</span>func<span style="color: #2f96dc;">)</span>:

            <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">We return the result of the original decorator, which, after all, </span>
            <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">IS JUST AN ORDINARY FUNCTION (which returns a function).</span>
            <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Only pitfall: the decorator must have this specific signature or it won't work:</span>
            <span style="color: #237fbf; font-weight: bold;">return</span> decorator_to_enhance<span style="color: #2f96dc;">(</span>func, *args, **kwargs<span style="color: #2f96dc;">)</span>

        <span style="color: #237fbf; font-weight: bold;">return</span> decorator_wrapper

    <span style="color: #237fbf; font-weight: bold;">return</span> decorator_maker
</pre>
</div>

<p>
接下来
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">You create the function you will use as a decorator. And stick a decorator on it :-)</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Don't forget, the signature is "decorator(func, *args, **kwargs)"</span>
<span style="color: #ce537a; font-weight: bold;">@decorator_with_args</span> 
<span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">decorated_decorator</span><span style="color: #2f96dc;">(</span>func, *args, **kwargs<span style="color: #2f96dc;">)</span>: 
    <span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">wrapper</span><span style="color: #2f96dc;">(</span>function_arg1, function_arg2<span style="color: #2f96dc;">)</span>:
        <span style="color: #237fbf; font-weight: bold;">print</span> <span style="color: #2d9574;">"Decorated with"</span>, args, kwargs
        <span style="color: #237fbf; font-weight: bold;">return</span> func<span style="color: #2f96dc;">(</span>function_arg1, function_arg2<span style="color: #2f96dc;">)</span>
    <span style="color: #237fbf; font-weight: bold;">return</span> wrapper

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Then you decorate the functions you wish with your brand new decorated decorator.</span>

<span style="color: #ce537a; font-weight: bold;">@decorated_decorator</span><span style="color: #2f96dc;">(</span><span style="color: #a45bad;">42</span>, <span style="color: #a45bad;">404</span>, <span style="color: #a45bad;">1024</span><span style="color: #2f96dc;">)</span>
<span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">decorated_function</span><span style="color: #2f96dc;">(</span>function_arg1, function_arg2<span style="color: #2f96dc;">)</span>:
    <span style="color: #237fbf; font-weight: bold;">print</span> <span style="color: #2d9574;">"Hello"</span>, function_arg1, function_arg2

decorated_function<span style="color: #2f96dc;">(</span><span style="color: #2d9574;">"Universe and"</span>, <span style="color: #2d9574;">"everything"</span><span style="color: #2f96dc;">)</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">outputs:</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">Decorated with (42, 404, 1024) {}</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">Hello Universe and everything</span>

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Whoooot!</span>
</pre>
</div>

<p>
I know, the last time you had this feeling, it was after listening a guy saying: "before understanding recursion, you must first understand recursion". But now, don't you feel good about mastering this?
不知道上面那段话怎么翻译.
</p>
</div>
</div>

<div id="outline-container-orgheadline21" class="outline-3">
<h3 id="orgheadline21"><span class="section-number-3">5.4</span> 最好的实践: 装饰器</h3>
<div class="outline-text-3" id="text-5-4">
<p>
请锦记下面几点:
</p>
<ul class="org-ul">
<li>迭代器在 Python 2.4 之后被引入,因为你的python环境必须在python2.4之上.</li>
<li>装饰器会降低函数调用,记在心里</li>
<li>函数(这个指的是被装饰的函数)不能单独运行.如果这个函数被装饰了,所有的代码就被装饰了.你不能之运行这个函数而不运行装饰器.</li>
<li><p>
装饰器包裹了函数,使得函数的debug比较困难.(在python2.5之后好了很多,下面的functools.wraps()解决了这点)
</p>

<p>
<b>functools</b> module 在python2.5中被引入,它内置的 "functools.wraps()"可以复制被装饰函数的name, module, and docstring 到 wrapper中.
</p></li>
</ul>

<p>
(号外: *functools.wraps()也是一个装饰器)
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">For debugging, the stacktrace prints you the function __name__</span>
<span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">foo</span><span style="color: #2f96dc;">()</span>:
    <span style="color: #237fbf; font-weight: bold;">print</span> <span style="color: #2d9574;">"foo"</span>

<span style="color: #237fbf; font-weight: bold;">print</span> foo.<span style="color: #1f71ab;">__name__</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">outputs: foo</span>

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">With a decorator, it gets messy    </span>
<span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">bar</span><span style="color: #2f96dc;">(</span>func<span style="color: #2f96dc;">)</span>:
    <span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">wrapper</span><span style="color: #2f96dc;">()</span>:
        <span style="color: #237fbf; font-weight: bold;">print</span> <span style="color: #2d9574;">"bar"</span>
        <span style="color: #237fbf; font-weight: bold;">return</span> func<span style="color: #2f96dc;">()</span>
    <span style="color: #237fbf; font-weight: bold;">return</span> wrapper

<span style="color: #ce537a; font-weight: bold;">@bar</span>
<span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">foo</span><span style="color: #2f96dc;">()</span>:
    <span style="color: #237fbf; font-weight: bold;">print</span> <span style="color: #2d9574;">"foo"</span>

<span style="color: #237fbf; font-weight: bold;">print</span> foo.<span style="color: #1f71ab;">__name__</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">outputs: wrapper</span>

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">"functools" can help for that</span>

<span style="color: #237fbf; font-weight: bold;">import</span> functools

<span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">bar</span><span style="color: #2f96dc;">(</span>func<span style="color: #2f96dc;">)</span>:
    <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">We say that "wrapper", is wrapping "func"</span>
    <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">and the magic begins</span>
    <span style="color: #ce537a; font-weight: bold;">@functools.wraps</span><span style="color: #2f96dc;">(</span>func<span style="color: #2f96dc;">)</span>
    <span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">wrapper</span><span style="color: #2f96dc;">()</span>:
        <span style="color: #237fbf; font-weight: bold;">print</span> <span style="color: #2d9574;">"bar"</span>
        <span style="color: #237fbf; font-weight: bold;">return</span> func<span style="color: #2f96dc;">()</span>
    <span style="color: #237fbf; font-weight: bold;">return</span> wrapper

<span style="color: #ce537a; font-weight: bold;">@bar</span>
<span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">foo</span><span style="color: #2f96dc;">()</span>:
    <span style="color: #237fbf; font-weight: bold;">print</span> <span style="color: #2d9574;">"foo"</span>

<span style="color: #237fbf; font-weight: bold;">print</span> foo.<span style="color: #1f71ab;">__name__</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">outputs: foo</span>
</pre>
</div>
</div>
</div>
