python/base/python的函数和对象.org
** 装饰器有什么用
这的确是一个好问题: 我用装饰器做什么?

虽然装饰器看起来很magic,但是有一个例子就会更加的明了,记住:装饰器可以让你的函数有无限的变化.
通过写一个用户类来 扩展一个外部lib或者debugging方式(也许你不想临时的修改)来扩展一个函数行为.

你也可以通过一种更DRY的方式来扩展函数.例如:
#+BEGIN_SRC python
  def benchmark(func):
      """
      A decorator that prints the time a function takes
      to execute.
      """
      import time
      def wrapper(*args, **kwargs):
          t = time.clock()
          res = func(*args, **kwargs)
          print func.__name__, time.clock()-t
          return res
      return wrapper


  def logging(func):
      """
      A decorator that logs the activity of the script.
      (it actually just prints it, but it could be logging!)
      """
      def wrapper(*args, **kwargs):
          res = func(*args, **kwargs)
          print func.__name__, args, kwargs
          return res
      return wrapper


  def counter(func):
      """
      A decorator that counts and prints the number of times a function has been executed
      """
      def wrapper(*args, **kwargs):
          wrapper.count = wrapper.count + 1
          res = func(*args, **kwargs)
          print "{0} has been used: {1}x".format(func.__name__, wrapper.count)
          return res
      wrapper.count = 0
      return wrapper

  @counter
  @benchmark
  @logging
  def reverse_string(string):
      return str(reversed(string))

  print reverse_string("Able was I ere I saw Elba")
  print reverse_string("A man, a plan, a canoe, pasta, heros, rajahs, a coloratura, maps, snipe, percale, macaroni, a gag, a banana bag, a tan, a tag, a banana bag again (or a camel), a crepe, pins, Spam, a rut, a Rolo, cash, a jar, sore hats, a peon, a canal: Panama!")

  #outputs:
  #reverse_string ('Able was I ere I saw Elba',) {}
  #wrapper 0.0
  #wrapper has been used: 1x 
  #ablE was I ere I saw elbA
  #reverse_string ('A man, a plan, a canoe, pasta, heros, rajahs, a coloratura, maps, snipe, percale, macaroni, a gag, a banana bag, a tan, a tag, a banana bag again (or a camel), a crepe, pins, Spam, a rut, a Rolo, cash, a jar, sore hats, a peon, a canal: Panama!',) {}
  #wrapper 0.0
  #wrapper has been used: 2x
  #!amanaP :lanac a ,noep a ,stah eros ,raj a ,hsac ,oloR a ,tur a ,mapS ,snip ,eperc a ,)lemac a ro( niaga gab ananab a ,gat a ,nat a ,gab ananab a ,gag a ,inoracam ,elacrep ,epins ,spam ,arutaroloc a ,shajar ,soreh ,atsap ,eonac a ,nalp a ,nam A
#+END_SRC

最大的好处应该你不用重写就可以使用他们到其他的函数.DRY.........
#+BEGIN_SRC python
  @counter
  @benchmark
  @logging
  def get_random_futurama_quote():
      from urllib import urlopen
      result = urlopen("http://subfusion.net/cgi-bin/quote.pl?quote=futurama").read()
      try:
          value = result.split("<br><b><hr><br>")[1].split("<br><br><hr>")[0]
          return value.strip()
      except:
          return "No, I'm ... doesn't!"


  print get_random_futurama_quote()
  print get_random_futurama_quote()

  #outputs:
  #get_random_futurama_quote () {}
  #wrapper 0.02
  #wrapper has been used: 1x
  #The laws of science be a harsh mistress.
  #get_random_futurama_quote () {}
  #wrapper 0.01
  #wrapper has been used: 2x
  #Curse you, merciful Poseidon!

#+END_SRC

一些用处:
+ 在python 内部提供了几个装饰器: @property,staticmethod,
+ Django 使用装饰器管理views权限
+ Twisted 用来实现内部的异步函数调用

** python的内置装饰器
内置的装饰器有三个:staticmethod,classmethod,property

