python/base/python的函数和对象.html

<div id="outline-container-orgheadline22" class="outline-3">
<h3 id="orgheadline22"><span class="section-number-3">5.5</span> 如何理解装饰器的执行步骤.</h3>
</div>
</div>


<div id="outline-container-orgheadline30" class="outline-2">
<h2 id="orgheadline30"><span class="section-number-2">6</span> 装饰器的用处</h2>
<div class="outline-text-2" id="text-6">
</div><div id="outline-container-orgheadline24" class="outline-3">
<h3 id="orgheadline24"><span class="section-number-3">6.1</span> 装饰器有什么用</h3>
<div class="outline-text-3" id="text-6-1">
<p>
这的确是一个好问题: 我用装饰器做什么?
</p>

<p>
虽然装饰器看起来很magic,但是有一个例子就会更加的明了,记住:装饰器可以让你的函数有无限的变化.
通过写一个用户类来 扩展一个外部lib或者debugging方式(也许你不想临时的修改)来扩展一个函数行为.
</p>

<p>
你也可以通过一种更DRY的方式来扩展函数.例如:
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">benchmark</span><span style="color: #2f96dc;">(</span>func<span style="color: #2f96dc;">)</span>:
    <span style="color: #2d9574;">"""</span>
<span style="color: #2d9574;">    A decorator that prints the time a function takes</span>
<span style="color: #2d9574;">    to execute.</span>
<span style="color: #2d9574;">    """</span>
    <span style="color: #237fbf; font-weight: bold;">import</span> time
    <span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">wrapper</span><span style="color: #2f96dc;">(</span>*args, **kwargs<span style="color: #2f96dc;">)</span>:
        <span style="color: #7590db;">t</span> = time.clock<span style="color: #2f96dc;">()</span>
        <span style="color: #7590db;">res</span> = func<span style="color: #2f96dc;">(</span>*args, **kwargs<span style="color: #2f96dc;">)</span>
        <span style="color: #237fbf; font-weight: bold;">print</span> func.<span style="color: #1f71ab;">__name__</span>, time.clock<span style="color: #2f96dc;">()</span>-t
        <span style="color: #237fbf; font-weight: bold;">return</span> res
    <span style="color: #237fbf; font-weight: bold;">return</span> wrapper


<span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">logging</span><span style="color: #2f96dc;">(</span>func<span style="color: #2f96dc;">)</span>:
    <span style="color: #2d9574;">"""</span>
<span style="color: #2d9574;">    A decorator that logs the activity of the script.</span>
<span style="color: #2d9574;">    (it actually just prints it, but it could be logging!)</span>
<span style="color: #2d9574;">    """</span>
    <span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">wrapper</span><span style="color: #2f96dc;">(</span>*args, **kwargs<span style="color: #2f96dc;">)</span>:
        <span style="color: #7590db;">res</span> = func<span style="color: #2f96dc;">(</span>*args, **kwargs<span style="color: #2f96dc;">)</span>
        <span style="color: #237fbf; font-weight: bold;">print</span> func.<span style="color: #1f71ab;">__name__</span>, args, kwargs
        <span style="color: #237fbf; font-weight: bold;">return</span> res
    <span style="color: #237fbf; font-weight: bold;">return</span> wrapper


<span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">counter</span><span style="color: #2f96dc;">(</span>func<span style="color: #2f96dc;">)</span>:
    <span style="color: #2d9574;">"""</span>
<span style="color: #2d9574;">    A decorator that counts and prints the number of times a function has been executed</span>
<span style="color: #2d9574;">    """</span>
    <span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">wrapper</span><span style="color: #2f96dc;">(</span>*args, **kwargs<span style="color: #2f96dc;">)</span>:
        <span style="color: #7590db;">wrapper.count</span> = wrapper.count + <span style="color: #a45bad;">1</span>
        <span style="color: #7590db;">res</span> = func<span style="color: #2f96dc;">(</span>*args, **kwargs<span style="color: #2f96dc;">)</span>
        <span style="color: #237fbf; font-weight: bold;">print</span> <span style="color: #2d9574;">"{0} has been used: {1}x"</span>.<span style="color: #1f71ab;">format</span><span style="color: #2f96dc;">(</span>func.<span style="color: #1f71ab;">__name__</span>, wrapper.count<span style="color: #2f96dc;">)</span>
        <span style="color: #237fbf; font-weight: bold;">return</span> res
    <span style="color: #7590db;">wrapper.count</span> = <span style="color: #a45bad;">0</span>
    <span style="color: #237fbf; font-weight: bold;">return</span> wrapper

<span style="color: #ce537a; font-weight: bold;">@counter</span>
<span style="color: #ce537a; font-weight: bold;">@benchmark</span>
<span style="color: #ce537a; font-weight: bold;">@logging</span>
<span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">reverse_string</span><span style="color: #2f96dc;">(</span>string<span style="color: #2f96dc;">)</span>:
    <span style="color: #237fbf; font-weight: bold;">return</span> <span style="color: #1f71ab;">str</span><span style="color: #2f96dc;">(</span><span style="color: #1f71ab;">reversed</span><span style="color: #bc6ec5;">(</span>string<span style="color: #bc6ec5;">)</span><span style="color: #2f96dc;">)</span>

<span style="color: #237fbf; font-weight: bold;">print</span> reverse_string<span style="color: #2f96dc;">(</span><span style="color: #2d9574;">"Able was I ere I saw Elba"</span><span style="color: #2f96dc;">)</span>
<span style="color: #237fbf; font-weight: bold;">print</span> reverse_string<span style="color: #2f96dc;">(</span><span style="color: #2d9574;">"A man, a plan, a canoe, pasta, heros, rajahs, a coloratura, maps, snipe, percale, macaroni, a gag, a banana bag, a tan, a tag, a banana bag again (or a camel), a crepe, pins, Spam, a rut, a Rolo, cash, a jar, sore hats, a peon, a canal: Panama!"</span><span style="color: #2f96dc;">)</span>

<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">outputs:</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">reverse_string ('Able was I ere I saw Elba',) {}</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">wrapper 0.0</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">wrapper has been used: 1x </span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">ablE was I ere I saw elbA</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">reverse_string ('A man, a plan, a canoe, pasta, heros, rajahs, a coloratura, maps, snipe, percale, macaroni, a gag, a banana bag, a tan, a tag, a banana bag again (or a camel), a crepe, pins, Spam, a rut, a Rolo, cash, a jar, sore hats, a peon, a canal: Panama!',) {}</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">wrapper 0.0</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">wrapper has been used: 2x</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">!amanaP :lanac a ,noep a ,stah eros ,raj a ,hsac ,oloR a ,tur a ,mapS ,snip ,eperc a ,)lemac a ro( niaga gab ananab a ,gat a ,nat a ,gab ananab a ,gag a ,inoracam ,elacrep ,epins ,spam ,arutaroloc a ,shajar ,soreh ,atsap ,eonac a ,nalp a ,nam A</span>
</pre>
</div>

<p>
最大的好处应该你不用重写就可以使用他们到其他的函数.DRY&#x2026;&#x2026;&#x2026;
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #ce537a; font-weight: bold;">@counter</span>
<span style="color: #ce537a; font-weight: bold;">@benchmark</span>
<span style="color: #ce537a; font-weight: bold;">@logging</span>
<span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">get_random_futurama_quote</span><span style="color: #2f96dc;">()</span>:
    <span style="color: #237fbf; font-weight: bold;">from</span> urllib <span style="color: #237fbf; font-weight: bold;">import</span> urlopen
    <span style="color: #7590db;">result</span> = urlopen<span style="color: #2f96dc;">(</span><span style="color: #2d9574;">"http://subfusion.net/cgi-bin/quote.pl?quote=futurama"</span><span style="color: #2f96dc;">)</span>.read<span style="color: #2f96dc;">()</span>
    <span style="color: #237fbf; font-weight: bold;">try</span>:
        <span style="color: #7590db;">value</span> = result.split<span style="color: #2f96dc;">(</span><span style="color: #2d9574;">"&lt;br&gt;&lt;b&gt;&lt;hr&gt;&lt;br&gt;"</span><span style="color: #2f96dc;">)[</span><span style="color: #a45bad;">1</span><span style="color: #2f96dc;">]</span>.split<span style="color: #2f96dc;">(</span><span style="color: #2d9574;">"&lt;br&gt;&lt;br&gt;&lt;hr&gt;"</span><span style="color: #2f96dc;">)[</span><span style="color: #a45bad;">0</span><span style="color: #2f96dc;">]</span>
        <span style="color: #237fbf; font-weight: bold;">return</span> value.strip<span style="color: #2f96dc;">()</span>
    <span style="color: #237fbf; font-weight: bold;">except</span>:
        <span style="color: #237fbf; font-weight: bold;">return</span> <span style="color: #2d9574;">"No, I'm ... doesn't!"</span>


<span style="color: #237fbf; font-weight: bold;">print</span> get_random_futurama_quote<span style="color: #2f96dc;">()</span>
<span style="color: #237fbf; font-weight: bold;">print</span> get_random_futurama_quote<span style="color: #2f96dc;">()</span>

<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">outputs:</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">get_random_futurama_quote () {}</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">wrapper 0.02</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">wrapper has been used: 1x</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">The laws of science be a harsh mistress.</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">get_random_futurama_quote () {}</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">wrapper 0.01</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">wrapper has been used: 2x</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">Curse you, merciful Poseidon!</span>
</pre>
</div>

<p>
一些用处:
</p>
<ul class="org-ul">
<li>在python 内部提供了几个装饰器: @property,staticmethod,</li>
<li>Django 使用装饰器管理views权限</li>
<li>Twisted 用来实现内部的异步函数调用</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline28" class="outline-3">
<h3 id="orgheadline28"><span class="section-number-3">6.2</span> python的内置装饰器</h3>
<div class="outline-text-3" id="text-6-2">
<p>
内置的装饰器有三个:staticmethod,classmethod,property
</p>
</div>
