python/base/python的函数和对象.org
*** staticmethod
staticmethod 是类静态方法，其跟成员方法的区别是没有 self 指针，并且可以在类不进行实例化的情况下调用，下面是一个实例，对比静态方法和成员方法

#+BEGIN_SRC python
  class Foo(object):  

      # 没有写self指针
      @staticmethod  
      def statc_method(msg):  
          print msg  
  
      def member_method(self, msg):  
          print msg  
  
  foo = Foo()  
  foo.member_method('some msg')  
  foo.statc_method('some msg')  
  # 这个Foo是为实例化的class
  Foo.statc_method('some msg')

  #output:    
  #    some msg  
  #    some msg  
  #    some msg  
 
#+END_SRC

*** classmethod
classmethod 与成员方法的区别在于所接收的第一个参数不是 self 类实例的指针，而是当前类的具体类型，下面是一个实例:


#+BEGIN_SRC python
  class Foo(object):  
      @classmethod  
      def class_method(cls):  
          print repr(cls)  
        
      def member_method(self):  
          print repr(self)  
      
  foo = Foo()  
  foo.class_method()  
  foo.member_method()

  # output:
  #     <class '__main__.Foo'>  
  #     <__main__.Foo object at 0x10a611c50>  
#+END_SRC

*** property
property 是属性的意思，即可以通过通过类实例直接访问的信息，下面是具体的例子:

#+BEGIN_SRC python
  class Foo(object):  
      def __init__(self, var):  
          super(Foo, self).__init__()  
          self._var = var  
     
      @property  
      def var(self):  
          return self._var  
     
      @var.setter  
      def var(self, var):  
          self._var = var  

  foo = Foo('var 1')  
  print foo.var  
  foo.var = 'var 2'  
  print foo.var  
  # output
  #     var 1  
  #     var 2  

#+END_SRC
p
** 这不是魔法系列(主要是flask的url解析)
这个有点长,在下个章节一个标题写这个



* 这不是魔法
** 前言
在Flask主页中，第一个例子就是利用了app.route()这个装饰器
#+BEGIN_SRC python
  app = Flask(__name__)
   
  @app.route("/")
  def hello():
      return "Hello World!"
#+END_SRC

