python/base/python的函数和对象.html

<div id="outline-container-orgheadline25" class="outline-4">
<h4 id="orgheadline25"><span class="section-number-4">6.2.1</span> staticmethod</h4>
<div class="outline-text-4" id="text-6-2-1">
<p>
staticmethod 是类静态方法，其跟成员方法的区别是没有 self 指针，并且可以在类不进行实例化的情况下调用，下面是一个实例，对比静态方法和成员方法
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #237fbf; font-weight: bold;">class</span> <span style="color: #ce537a; font-weight: bold;">Foo</span><span style="color: #2f96dc;">(</span><span style="color: #1f71ab;">object</span><span style="color: #2f96dc;">)</span>:  

    <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#27809;&#26377;&#20889;self&#25351;&#38024;</span>
    <span style="color: #ce537a; font-weight: bold;">@staticmethod</span>  
    <span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">statc_method</span><span style="color: #2f96dc;">(</span>msg<span style="color: #2f96dc;">)</span>:  
        <span style="color: #237fbf; font-weight: bold;">print</span> msg  

    <span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">member_method</span><span style="color: #2f96dc;">(</span><span style="color: #237fbf; font-weight: bold;">self</span>, msg<span style="color: #2f96dc;">)</span>:  
        <span style="color: #237fbf; font-weight: bold;">print</span> msg  

<span style="color: #7590db;">foo</span> = Foo<span style="color: #2f96dc;">()</span>  
foo.member_method<span style="color: #2f96dc;">(</span><span style="color: #2d9574;">'some msg'</span><span style="color: #2f96dc;">)</span>  
foo.statc_method<span style="color: #2f96dc;">(</span><span style="color: #2d9574;">'some msg'</span><span style="color: #2f96dc;">)</span>  
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#36825;&#20010;Foo&#26159;&#20026;&#23454;&#20363;&#21270;&#30340;class</span>
Foo.statc_method<span style="color: #2f96dc;">(</span><span style="color: #2d9574;">'some msg'</span><span style="color: #2f96dc;">)</span>

<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">output:    </span>
<span style="color: #2aa1ae; background-color: #292e34;">#    </span><span style="color: #2aa1ae; background-color: #292e34;">some msg  </span>
<span style="color: #2aa1ae; background-color: #292e34;">#    </span><span style="color: #2aa1ae; background-color: #292e34;">some msg  </span>
<span style="color: #2aa1ae; background-color: #292e34;">#    </span><span style="color: #2aa1ae; background-color: #292e34;">some msg</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline26" class="outline-4">
<h4 id="orgheadline26"><span class="section-number-4">6.2.2</span> classmethod</h4>
<div class="outline-text-4" id="text-6-2-2">
<p>
classmethod 与成员方法的区别在于所接收的第一个参数不是 self 类实例的指针，而是当前类的具体类型，下面是一个实例:
</p>


<div class="org-src-container">

<pre class="src src-python"><span style="color: #237fbf; font-weight: bold;">class</span> <span style="color: #ce537a; font-weight: bold;">Foo</span><span style="color: #2f96dc;">(</span><span style="color: #1f71ab;">object</span><span style="color: #2f96dc;">)</span>:  
    <span style="color: #ce537a; font-weight: bold;">@classmethod</span>  
    <span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">class_method</span><span style="color: #2f96dc;">(</span>cls<span style="color: #2f96dc;">)</span>:  
        <span style="color: #237fbf; font-weight: bold;">print</span> <span style="color: #1f71ab;">repr</span><span style="color: #2f96dc;">(</span>cls<span style="color: #2f96dc;">)</span>  

    <span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">member_method</span><span style="color: #2f96dc;">(</span><span style="color: #237fbf; font-weight: bold;">self</span><span style="color: #2f96dc;">)</span>:  
        <span style="color: #237fbf; font-weight: bold;">print</span> <span style="color: #1f71ab;">repr</span><span style="color: #2f96dc;">(</span><span style="color: #237fbf; font-weight: bold;">self</span><span style="color: #2f96dc;">)</span>  

<span style="color: #7590db;">foo</span> = Foo<span style="color: #2f96dc;">()</span>  
foo.class_method<span style="color: #2f96dc;">()</span>  
foo.member_method<span style="color: #2f96dc;">()</span>

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">output:</span>
<span style="color: #2aa1ae; background-color: #292e34;">#     </span><span style="color: #2aa1ae; background-color: #292e34;">&lt;class '__main__.Foo'&gt;  </span>
<span style="color: #2aa1ae; background-color: #292e34;">#     </span><span style="color: #2aa1ae; background-color: #292e34;">&lt;__main__.Foo object at 0x10a611c50&gt;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline27" class="outline-4">
<h4 id="orgheadline27"><span class="section-number-4">6.2.3</span> property</h4>
<div class="outline-text-4" id="text-6-2-3">
<p>
property 是属性的意思，即可以通过通过类实例直接访问的信息，下面是具体的例子:
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #237fbf; font-weight: bold;">class</span> <span style="color: #ce537a; font-weight: bold;">Foo</span><span style="color: #2f96dc;">(</span><span style="color: #1f71ab;">object</span><span style="color: #2f96dc;">)</span>:  
    <span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">__init__</span><span style="color: #2f96dc;">(</span><span style="color: #237fbf; font-weight: bold;">self</span>, var<span style="color: #2f96dc;">)</span>:  
        <span style="color: #1f71ab;">super</span><span style="color: #2f96dc;">(</span>Foo, <span style="color: #237fbf; font-weight: bold;">self</span><span style="color: #2f96dc;">)</span>.__init__<span style="color: #2f96dc;">()</span>  
        <span style="color: #237fbf; font-weight: bold;">self</span>._var = var  

    <span style="color: #ce537a; font-weight: bold;">@property</span>  
    <span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">var</span><span style="color: #2f96dc;">(</span><span style="color: #237fbf; font-weight: bold;">self</span><span style="color: #2f96dc;">)</span>:  
        <span style="color: #237fbf; font-weight: bold;">return</span> <span style="color: #237fbf; font-weight: bold;">self</span>._var  

    <span style="color: #ce537a; font-weight: bold;">@var.setter</span>  
    <span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">var</span><span style="color: #2f96dc;">(</span><span style="color: #237fbf; font-weight: bold;">self</span>, var<span style="color: #2f96dc;">)</span>:  
        <span style="color: #237fbf; font-weight: bold;">self</span>._var = var  

<span style="color: #7590db;">foo</span> = Foo<span style="color: #2f96dc;">(</span><span style="color: #2d9574;">'var 1'</span><span style="color: #2f96dc;">)</span>  
<span style="color: #237fbf; font-weight: bold;">print</span> foo.var  
<span style="color: #7590db;">foo.var</span> = <span style="color: #2d9574;">'var 2'</span>  
<span style="color: #237fbf; font-weight: bold;">print</span> foo.var  
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">output</span>
<span style="color: #2aa1ae; background-color: #292e34;">#     </span><span style="color: #2aa1ae; background-color: #292e34;">var 1  </span>
<span style="color: #2aa1ae; background-color: #292e34;">#     </span><span style="color: #2aa1ae; background-color: #292e34;">var 2</span>
</pre>
</div>
<p>
p
</p>
</div>
</div>
</div>
<div id="outline-container-orgheadline29" class="outline-3">
<h3 id="orgheadline29"><span class="section-number-3">6.3</span> 这不是魔法系列(主要是flask的url解析)</h3>
<div class="outline-text-3" id="text-6-3">
<p>
这个有点长,在下个章节一个标题写这个
</p>
</div>
</div>
</div>



<div id="outline-container-orgheadline37" class="outline-2">
<h2 id="orgheadline37"><span class="section-number-2">7</span> 这不是魔法</h2>
<div class="outline-text-2" id="text-7">
</div><div id="outline-container-orgheadline31" class="outline-3">
<h3 id="orgheadline31"><span class="section-number-3">7.1</span> 前言</h3>
<div class="outline-text-3" id="text-7-1">
<p>
在Flask主页中，第一个例子就是利用了app.route()这个装饰器
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #7590db;">app</span> = Flask<span style="color: #2f96dc;">(</span><span style="color: #1f71ab;">__name__</span><span style="color: #2f96dc;">)</span>

<span style="color: #ce537a; font-weight: bold;">@app.route</span><span style="color: #2f96dc;">(</span><span style="color: #2d9574;">"/"</span><span style="color: #2f96dc;">)</span>
<span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">hello</span><span style="color: #2f96dc;">()</span>:
    <span style="color: #237fbf; font-weight: bold;">return</span> <span style="color: #2d9574;">"Hello World!"</span>
</pre>
</div>
</div>
</div>
