python/base/python的函数和对象.org
** 装饰器
装饰器是一种接受函数，并返回一个新的函数。

当你装饰一个函数的时候，意味着你告诉Python调用的是那个由你的装饰器返回的新函数，而不仅仅是直接返回原函数的执行结果。

#+BEGIN_SRC python
  # This is our decorator
  def simple_decorator(f):
      # This is the new function we're going to return
      # This function will be used in place of our original definition
      def wrapper():
          print "Entering Function"
          f()
          print "Exited Function"
   
      return wrapper
   
  @simple_decorator 
  def hello():
      print "Hello World"
   
  hello()

#+END_SRC 

执行结果：
#+BEGIN_EXAMPLE
  Entering Function
  Hello World
  Exited Function
#+END_EXAMPLE

但是这个装饰器和"app.route()"不同的一点就是这个装饰器不能接受参数，但是"app.route()"却可以。


那么我们怎样才能给我们的装饰器传参数？要实现这个我们只需创建一个“decorator_factory”函数，我们调用这个函数，返回适用于我们函数的装饰器。现在看看如果实现它。

#+BEGIN_SRC python
  def decorator_factory(enter_message, exit_message):
      # We're going to return this decorator
      def simple_decorator(f):
          def wrapper():
              print enter_message
              f()
              print exit_message
   
          return wrapper
   
      return simple_decorator
   
  @decorator_factory("Start", "End")
  def hello():
      print "Hello World"
   
  hello()
#+END_SRC

输出结果：
#+BEGIN_EXAMPLE
  Start
  Hello World
  End
#+END_EXAMPLE

