python/base/python的函数和对象.html

<div id="outline-container-orgheadline32" class="outline-3">
<h3 id="orgheadline32"><span class="section-number-3">7.2</span> 装饰器</h3>
<div class="outline-text-3" id="text-7-2">
<p>
装饰器是一种接受函数，并返回一个新的函数。
</p>

<p>
当你装饰一个函数的时候，意味着你告诉Python调用的是那个由你的装饰器返回的新函数，而不仅仅是直接返回原函数的执行结果。
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">This is our decorator</span>
<span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">simple_decorator</span><span style="color: #2f96dc;">(</span>f<span style="color: #2f96dc;">)</span>:
    <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">This is the new function we're going to return</span>
    <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">This function will be used in place of our original definition</span>
    <span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">wrapper</span><span style="color: #2f96dc;">()</span>:
        <span style="color: #237fbf; font-weight: bold;">print</span> <span style="color: #2d9574;">"Entering Function"</span>
        f<span style="color: #2f96dc;">()</span>
        <span style="color: #237fbf; font-weight: bold;">print</span> <span style="color: #2d9574;">"Exited Function"</span>

    <span style="color: #237fbf; font-weight: bold;">return</span> wrapper

<span style="color: #ce537a; font-weight: bold;">@simple_decorator</span> 
<span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">hello</span><span style="color: #2f96dc;">()</span>:
    <span style="color: #237fbf; font-weight: bold;">print</span> <span style="color: #2d9574;">"Hello World"</span>

hello<span style="color: #2f96dc;">()</span>
</pre>
</div>

<p>
执行结果：
</p>
<pre class="example">
Entering Function
Hello World
Exited Function
</pre>

<p>
但是这个装饰器和"app.route()"不同的一点就是这个装饰器不能接受参数，但是"app.route()"却可以。
</p>


<p>
那么我们怎样才能给我们的装饰器传参数？要实现这个我们只需创建一个“decorator_factory”函数，我们调用这个函数，返回适用于我们函数的装饰器。现在看看如果实现它。
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">decorator_factory</span><span style="color: #2f96dc;">(</span>enter_message, exit_message<span style="color: #2f96dc;">)</span>:
    <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">We're going to return this decorator</span>
    <span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">simple_decorator</span><span style="color: #2f96dc;">(</span>f<span style="color: #2f96dc;">)</span>:
        <span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">wrapper</span><span style="color: #2f96dc;">()</span>:
            <span style="color: #237fbf; font-weight: bold;">print</span> enter_message
            f<span style="color: #2f96dc;">()</span>
            <span style="color: #237fbf; font-weight: bold;">print</span> exit_message

        <span style="color: #237fbf; font-weight: bold;">return</span> wrapper

    <span style="color: #237fbf; font-weight: bold;">return</span> simple_decorator

<span style="color: #ce537a; font-weight: bold;">@decorator_factory</span><span style="color: #2f96dc;">(</span><span style="color: #2d9574;">"Start"</span>, <span style="color: #2d9574;">"End"</span><span style="color: #2f96dc;">)</span>
<span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">hello</span><span style="color: #2f96dc;">()</span>:
    <span style="color: #237fbf; font-weight: bold;">print</span> <span style="color: #2d9574;">"Hello World"</span>

hello<span style="color: #2f96dc;">()</span>
</pre>
</div>

<p>
输出结果：
</p>
<pre class="example">
Start
Hello World
End
</pre>
</div>
</div>
