python/base/python的函数和对象.org
** 将 app 放进app.route
现在我们掌握了装饰器怎样工作的全部前置知识 ，可以重新实现Flask API的这个部分了，那么把我们的目光转移到“app”在我们Flask应用中的重要地位上面来。


在开始解释Flask对象里面发生了什么之前，我们先创建我们自己的Python类NotFlask。

#+BEGIN_SRC python
  class NotFlask():
      pass
   
  app = NotFlask()
#+END_SRC

这不是个很有趣的类，不过有一样值得注意，就是这个类的方法也可以被用作装饰器，所以让我们把这个类写得更有趣一点，加一个称作 route的方法，它是一个简单的装饰器工厂。

#+BEGIN_SRC python
  class NotFlask():
      def route(self, route_str):
          def decorator(f):
              return f
   
          return decorator
   
  app = NotFlask()
   
  @app.route("/")
  def hello():
      return "Hello World!"
#+END_SRC

这个装饰器和我们之前创建的那些最大的不同，在于我们不想修改被我们装饰的函数的行为，我们只是想获得它的引用。

所以，最后一步是我们打算去利用一个特性，就是用装饰器函数的副产品去保存一个提供给我们的路径之间的链接，装饰器函数应该与它关联起来。

为了实现这个，我们给我们的NotFlask对象加一个“routes”字典，当我们的“decorator”函数被调用，路径将被插入新字典中函数对应的位置。

#+BEGIN_SRC python
  class NotFlask():
      def __init__(self):
          self.routes = {}
   
      def route(self, route_str):
          def decorator(f):
              self.routes[route_str] = f
              return f
   
          return decorator
   
  app = NotFlask()
   
  @app.route("/")
  def hello():
      return "Hello World!"
#+END_SRC


现在我们就要完成了！可如果没法访问内部的视图函数，保存路径的字典又有什么用？让我们加入一个方法serve(path)，当给定的路径存在时运行一个函数并给们我结果，当路径尚未注册时则抛出一个异常。

#+BEGIN_SRC python
  class NotFlask():
      def __init__(self):
          self.routes = {}
   
      def route(self, route_str):
          def decorator(f):
              self.routes[route_str] = f
              return f
   
          return decorator
   
      def serve(self, path):
          view_function = self.routes.get(path)
          if view_function:
              return view_function()
          else:
              raise ValueError('Route "{}"" has not been registered'.format(path))
   
  app = NotFlask()
   
  @app.route("/")
  def hello():
      return "Hello World!"
#+END_SRC

在这个系列我们只关注重现那些热门库提供的友好API，所以钩挂“serve”方法实现一个HTTP服务器其实有一点超出本文的范围，当然结果是确定的，运行下述片段：

#+BEGIN_EXAMPLE
  app = NotFlask()
   
  @app.route("/")
  def hello():
      return "Hello World!"
   
  print app.serve("/")
#+END_EXAMPLE

我们会看到：
#+BEGIN_EXAMPLE
  Hello World!
#+END_EXAMPLE


我们已经完成了一个的Flask网页上第一个例子的非常简单的重现，让我们写一些快速测试检测我们简单重现的Flask的“@app.route()”是否正确。
#+BEGIN_SRC python
  class TestNotFlask(unittest.TestCase):
      def setUp(self):
          self.app = NotFlask()
   
      def test_valid_route(self):
          @self.app.route('/')
          def index():
              return 'Hello World'
   
          self.assertEqual(self.app.serve('/'), 'Hello World')
   
      def test_invalid_route(self):
          with self.assertRaises(ValueError):
              self.app.serve('/invalid')
#+END_SRC

** 以正则的形式表达我们的路径
现在我们将允许我们的URL动态变化，我们不再能够将用先前使用“@app.route()”注册的路径直接与路径实例比较。

我们将用什么替代？我们需要用上正则表达式，这样我们就可以将路径作为一种模式进行匹配，而不和一条固定的字符串比较了。

那么，我们的第一步是将我们的路径转化成正则表达式模式，这样我们就能在输入路径实例时进行匹配。我们也将使用这个正则表达式提取我们感兴趣的变量。

那么，匹配路径”/hello/”的正则表达式该长啥样呢？

嗯一个简单的正则表达式譬如“^/hello/(.+)$”将是个好的开始，让我们一起看看它和代码是怎么一起工作的：

#+BEGIN_EXAMPLE
  import re
   
  route_regex = re.compile(r"^/hello/(.+)$")
  match = route_regex.match("/hello/ains")
   
  print match.groups()
#+END_EXAMPLE

将会输出：
#+BEGIN_EXAMPLE
  ('ains',)
#+END_EXAMPLE

不错，不过，理想情况是我们想要维护我们已经匹配上的第一组链接，并且从路径“/hello/”识别出“username”。

