python/base/python的函数和对象.html

<div id="outline-container-orgheadline33" class="outline-3">
<h3 id="orgheadline33"><span class="section-number-3">7.3</span> 将 app 放进app.route</h3>
<div class="outline-text-3" id="text-7-3">
<p>
现在我们掌握了装饰器怎样工作的全部前置知识 ，可以重新实现Flask API的这个部分了，那么把我们的目光转移到“app”在我们Flask应用中的重要地位上面来。
</p>


<p>
在开始解释Flask对象里面发生了什么之前，我们先创建我们自己的Python类NotFlask。
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #237fbf; font-weight: bold;">class</span> <span style="color: #ce537a; font-weight: bold;">NotFlask</span><span style="color: #2f96dc;">()</span>:
    <span style="color: #237fbf; font-weight: bold;">pass</span>

<span style="color: #7590db;">app</span> = NotFlask<span style="color: #2f96dc;">()</span>
</pre>
</div>

<p>
这不是个很有趣的类，不过有一样值得注意，就是这个类的方法也可以被用作装饰器，所以让我们把这个类写得更有趣一点，加一个称作 route的方法，它是一个简单的装饰器工厂。
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #237fbf; font-weight: bold;">class</span> <span style="color: #ce537a; font-weight: bold;">NotFlask</span><span style="color: #2f96dc;">()</span>:
    <span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">route</span><span style="color: #2f96dc;">(</span><span style="color: #237fbf; font-weight: bold;">self</span>, route_str<span style="color: #2f96dc;">)</span>:
        <span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">decorator</span><span style="color: #2f96dc;">(</span>f<span style="color: #2f96dc;">)</span>:
            <span style="color: #237fbf; font-weight: bold;">return</span> f

        <span style="color: #237fbf; font-weight: bold;">return</span> decorator

<span style="color: #7590db;">app</span> = NotFlask<span style="color: #2f96dc;">()</span>

<span style="color: #ce537a; font-weight: bold;">@app.route</span><span style="color: #2f96dc;">(</span><span style="color: #2d9574;">"/"</span><span style="color: #2f96dc;">)</span>
<span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">hello</span><span style="color: #2f96dc;">()</span>:
    <span style="color: #237fbf; font-weight: bold;">return</span> <span style="color: #2d9574;">"Hello World!"</span>
</pre>
</div>

<p>
这个装饰器和我们之前创建的那些最大的不同，在于我们不想修改被我们装饰的函数的行为，我们只是想获得它的引用。
</p>

<p>
所以，最后一步是我们打算去利用一个特性，就是用装饰器函数的副产品去保存一个提供给我们的路径之间的链接，装饰器函数应该与它关联起来。
</p>

<p>
为了实现这个，我们给我们的NotFlask对象加一个“routes”字典，当我们的“decorator”函数被调用，路径将被插入新字典中函数对应的位置。
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #237fbf; font-weight: bold;">class</span> <span style="color: #ce537a; font-weight: bold;">NotFlask</span><span style="color: #2f96dc;">()</span>:
    <span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">__init__</span><span style="color: #2f96dc;">(</span><span style="color: #237fbf; font-weight: bold;">self</span><span style="color: #2f96dc;">)</span>:
        <span style="color: #237fbf; font-weight: bold;">self</span>.routes = <span style="color: #2f96dc;">{}</span>

    <span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">route</span><span style="color: #2f96dc;">(</span><span style="color: #237fbf; font-weight: bold;">self</span>, route_str<span style="color: #2f96dc;">)</span>:
        <span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">decorator</span><span style="color: #2f96dc;">(</span>f<span style="color: #2f96dc;">)</span>:
            <span style="color: #237fbf; font-weight: bold;">self</span>.routes<span style="color: #2f96dc;">[</span>route_str<span style="color: #2f96dc;">]</span> = f
            <span style="color: #237fbf; font-weight: bold;">return</span> f

        <span style="color: #237fbf; font-weight: bold;">return</span> decorator

<span style="color: #7590db;">app</span> = NotFlask<span style="color: #2f96dc;">()</span>

<span style="color: #ce537a; font-weight: bold;">@app.route</span><span style="color: #2f96dc;">(</span><span style="color: #2d9574;">"/"</span><span style="color: #2f96dc;">)</span>
<span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">hello</span><span style="color: #2f96dc;">()</span>:
    <span style="color: #237fbf; font-weight: bold;">return</span> <span style="color: #2d9574;">"Hello World!"</span>
</pre>
</div>


<p>
现在我们就要完成了！可如果没法访问内部的视图函数，保存路径的字典又有什么用？让我们加入一个方法serve(path)，当给定的路径存在时运行一个函数并给们我结果，当路径尚未注册时则抛出一个异常。
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #237fbf; font-weight: bold;">class</span> <span style="color: #ce537a; font-weight: bold;">NotFlask</span><span style="color: #2f96dc;">()</span>:
    <span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">__init__</span><span style="color: #2f96dc;">(</span><span style="color: #237fbf; font-weight: bold;">self</span><span style="color: #2f96dc;">)</span>:
        <span style="color: #237fbf; font-weight: bold;">self</span>.routes = <span style="color: #2f96dc;">{}</span>

    <span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">route</span><span style="color: #2f96dc;">(</span><span style="color: #237fbf; font-weight: bold;">self</span>, route_str<span style="color: #2f96dc;">)</span>:
        <span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">decorator</span><span style="color: #2f96dc;">(</span>f<span style="color: #2f96dc;">)</span>:
            <span style="color: #237fbf; font-weight: bold;">self</span>.routes<span style="color: #2f96dc;">[</span>route_str<span style="color: #2f96dc;">]</span> = f
            <span style="color: #237fbf; font-weight: bold;">return</span> f

        <span style="color: #237fbf; font-weight: bold;">return</span> decorator

    <span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">serve</span><span style="color: #2f96dc;">(</span><span style="color: #237fbf; font-weight: bold;">self</span>, path<span style="color: #2f96dc;">)</span>:
        <span style="color: #7590db;">view_function</span> = <span style="color: #237fbf; font-weight: bold;">self</span>.routes.get<span style="color: #2f96dc;">(</span>path<span style="color: #2f96dc;">)</span>
        <span style="color: #237fbf; font-weight: bold;">if</span> view_function:
            <span style="color: #237fbf; font-weight: bold;">return</span> view_function<span style="color: #2f96dc;">()</span>
        <span style="color: #237fbf; font-weight: bold;">else</span>:
            <span style="color: #237fbf; font-weight: bold;">raise</span> <span style="color: #ce537a; font-weight: bold;">ValueError</span><span style="color: #2f96dc;">(</span><span style="color: #2d9574;">'Route "{}"" has not been registered'</span>.<span style="color: #1f71ab;">format</span><span style="color: #bc6ec5;">(</span>path<span style="color: #bc6ec5;">)</span><span style="color: #2f96dc;">)</span>

<span style="color: #7590db;">app</span> = NotFlask<span style="color: #2f96dc;">()</span>

<span style="color: #ce537a; font-weight: bold;">@app.route</span><span style="color: #2f96dc;">(</span><span style="color: #2d9574;">"/"</span><span style="color: #2f96dc;">)</span>
<span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">hello</span><span style="color: #2f96dc;">()</span>:
    <span style="color: #237fbf; font-weight: bold;">return</span> <span style="color: #2d9574;">"Hello World!"</span>
</pre>
</div>

<p>
在这个系列我们只关注重现那些热门库提供的友好API，所以钩挂“serve”方法实现一个HTTP服务器其实有一点超出本文的范围，当然结果是确定的，运行下述片段：
</p>

<pre class="example">
app = NotFlask()

@app.route("/")
def hello():
    return "Hello World!"

print app.serve("/")
</pre>

<p>
我们会看到：
</p>
<pre class="example">
Hello World!
</pre>


<p>
我们已经完成了一个的Flask网页上第一个例子的非常简单的重现，让我们写一些快速测试检测我们简单重现的Flask的“@app.route()”是否正确。
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #237fbf; font-weight: bold;">class</span> <span style="color: #ce537a; font-weight: bold;">TestNotFlask</span><span style="color: #2f96dc;">(</span>unittest.TestCase<span style="color: #2f96dc;">)</span>:
    <span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">setUp</span><span style="color: #2f96dc;">(</span><span style="color: #237fbf; font-weight: bold;">self</span><span style="color: #2f96dc;">)</span>:
        <span style="color: #237fbf; font-weight: bold;">self</span>.app = NotFlask<span style="color: #2f96dc;">()</span>

    <span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">test_valid_route</span><span style="color: #2f96dc;">(</span><span style="color: #237fbf; font-weight: bold;">self</span><span style="color: #2f96dc;">)</span>:
        @<span style="color: #237fbf; font-weight: bold;">self</span>.app.route<span style="color: #2f96dc;">(</span><span style="color: #2d9574;">'/'</span><span style="color: #2f96dc;">)</span>
        <span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">index</span><span style="color: #2f96dc;">()</span>:
            <span style="color: #237fbf; font-weight: bold;">return</span> <span style="color: #2d9574;">'Hello World'</span>

        <span style="color: #237fbf; font-weight: bold;">self</span>.assertEqual<span style="color: #2f96dc;">(</span><span style="color: #237fbf; font-weight: bold;">self</span>.app.serve<span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">'/'</span><span style="color: #bc6ec5;">)</span>, <span style="color: #2d9574;">'Hello World'</span><span style="color: #2f96dc;">)</span>

    <span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">test_invalid_route</span><span style="color: #2f96dc;">(</span><span style="color: #237fbf; font-weight: bold;">self</span><span style="color: #2f96dc;">)</span>:
        <span style="color: #237fbf; font-weight: bold;">with</span> <span style="color: #237fbf; font-weight: bold;">self</span>.assertRaises<span style="color: #2f96dc;">(</span><span style="color: #ce537a; font-weight: bold;">ValueError</span><span style="color: #2f96dc;">)</span>:
            <span style="color: #237fbf; font-weight: bold;">self</span>.app.serve<span style="color: #2f96dc;">(</span><span style="color: #2d9574;">'/invalid'</span><span style="color: #2f96dc;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline34" class="outline-3">
<h3 id="orgheadline34"><span class="section-number-3">7.4</span> 以正则的形式表达我们的路径</h3>
<div class="outline-text-3" id="text-7-4">
<p>
现在我们将允许我们的URL动态变化，我们不再能够将用先前使用“@app.route()”注册的路径直接与路径实例比较。
</p>

<p>
我们将用什么替代？我们需要用上正则表达式，这样我们就可以将路径作为一种模式进行匹配，而不和一条固定的字符串比较了。
</p>

<p>
那么，我们的第一步是将我们的路径转化成正则表达式模式，这样我们就能在输入路径实例时进行匹配。我们也将使用这个正则表达式提取我们感兴趣的变量。
</p>

<p>
那么，匹配路径”/hello/”的正则表达式该长啥样呢？
</p>

<p>
嗯一个简单的正则表达式譬如“^/hello/(.+)$”将是个好的开始，让我们一起看看它和代码是怎么一起工作的：
</p>

<pre class="example">
import re

route_regex = re.compile(r"^/hello/(.+)$")
match = route_regex.match("/hello/ains")

print match.groups()
</pre>

<p>
将会输出：
</p>
<pre class="example">
('ains',)
</pre>

<p>
不错，不过，理想情况是我们想要维护我们已经匹配上的第一组链接，并且从路径“/hello/”识别出“username”。
</p>
</div>
</div>
