python/base/python的函数和对象.org
** 命名捕获组
幸运的是，正则表达式也支持命名捕获组，允许我们给匹配组分配一个名字，我们能在读取我们的匹配之后找回它。

我们可以使用下述符号，给出第一个例子识别“username”的捕获组。

#+BEGIN_SRC python
  /hello/(<?P<username>.+)"
#+END_SRC

然后我们可以对我们的正则表达式使用groupdict()方法，将所有捕获组当作一个字典，组的名字对应匹配上的值。

那么我们给出下述代码：

#+BEGIN_SRC python
  route_regex = re.compile(r'^/hello/(?P<username>.+)$')
  match = route_regex.match("/hello/ains")
   
  print match.groupdict()
#+END_SRC

将为我们输出一下字典：
#+BEGIN_EXAMPLE
  {'username': 'ains'}
#+END_EXAMPLE

现在，有了我们所需要的正则表达式的格式，以及如何使用它们去匹配输入的URLs的知识，最后剩下的是写一个方法，将我们声明的路径转换成它们等价的正则表达式模式。

要做这个我们将使用另一个正则表达式（接下来将全是正则表达式），为了让我们路径中的变量转换成正则表示式模式，那这里作为示范我们将将“”转换成“(?P.+)”。

听起来太简单了！我们将可以只用一行新代码实现它。

#+BEGIN_SRC python
  def build_route_pattern(route):
      route_regex = re.sub(r'(<\w+>)', r'(?P\1.+)', route)
      return re.compile("^{}$".format(route_regex))
   
  print build_route_pattern('/hello/<username>')
#+END_SRC

这里我们用一个正则表达式代表所有出现的模式（一个包含在尖括号中的字符串），与它的正则表达式命名组等价。

re.sub的第一个参数 我们将我们的模式放进括号，目的是把它分配到第一个匹配组。在我们的第二个参数，我们可以使用第一匹配组的内容，方法是写1（2将是第二匹配组的内容，以此类推…….）

那么最后，输入模式

#+BEGIN_SRC python
  /hello/<username>
#+END_SRC

将给我们正则表达式：
#+BEGIN_SRC python
  ^/hello/(?P<username>.+)$
#+END_SRC

