python/base/python的函数和对象.html

<div id="outline-container-orgheadline35" class="outline-3">
<h3 id="orgheadline35"><span class="section-number-3">7.5</span> 命名捕获组</h3>
<div class="outline-text-3" id="text-7-5">
<p>
幸运的是，正则表达式也支持命名捕获组，允许我们给匹配组分配一个名字，我们能在读取我们的匹配之后找回它。
</p>

<p>
我们可以使用下述符号，给出第一个例子识别“username”的捕获组。
</p>

<div class="org-src-container">

<pre class="src src-python">/hello/<span style="color: #2f96dc;">(</span>&lt;?P&lt;username&gt;.+<span style="color: #2f96dc;">)</span><span style="color: #2d9574;">"</span>
</pre>
</div>

<p>
然后我们可以对我们的正则表达式使用groupdict()方法，将所有捕获组当作一个字典，组的名字对应匹配上的值。
</p>

<p>
那么我们给出下述代码：
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #7590db;">route_regex</span> = re.<span style="color: #1f71ab;">compile</span><span style="color: #2f96dc;">(</span>r<span style="color: #2d9574;">'^/hello/(?P&lt;username&gt;.+)$'</span><span style="color: #2f96dc;">)</span>
<span style="color: #7590db;">match</span> = route_regex.match<span style="color: #2f96dc;">(</span><span style="color: #2d9574;">"/hello/ains"</span><span style="color: #2f96dc;">)</span>

<span style="color: #237fbf; font-weight: bold;">print</span> match.groupdict<span style="color: #2f96dc;">()</span>
</pre>
</div>

<p>
将为我们输出一下字典：
</p>
<pre class="example">
{'username': 'ains'}
</pre>

<p>
现在，有了我们所需要的正则表达式的格式，以及如何使用它们去匹配输入的URLs的知识，最后剩下的是写一个方法，将我们声明的路径转换成它们等价的正则表达式模式。
</p>

<p>
要做这个我们将使用另一个正则表达式（接下来将全是正则表达式），为了让我们路径中的变量转换成正则表示式模式，那这里作为示范我们将将“”转换成“(?P.+)”。
</p>

<p>
听起来太简单了！我们将可以只用一行新代码实现它。
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">build_route_pattern</span><span style="color: #2f96dc;">(</span>route<span style="color: #2f96dc;">)</span>:
    <span style="color: #7590db;">route_regex</span> = re.sub<span style="color: #2f96dc;">(</span>r<span style="color: #2d9574;">'(&lt;\w+&gt;)'</span>, r<span style="color: #2d9574;">'(?P\1.+)'</span>, route<span style="color: #2f96dc;">)</span>
    <span style="color: #237fbf; font-weight: bold;">return</span> re.<span style="color: #1f71ab;">compile</span><span style="color: #2f96dc;">(</span><span style="color: #2d9574;">"^{}$"</span>.<span style="color: #1f71ab;">format</span><span style="color: #bc6ec5;">(</span>route_regex<span style="color: #bc6ec5;">)</span><span style="color: #2f96dc;">)</span>

<span style="color: #237fbf; font-weight: bold;">print</span> build_route_pattern<span style="color: #2f96dc;">(</span><span style="color: #2d9574;">'/hello/&lt;username&gt;'</span><span style="color: #2f96dc;">)</span>
</pre>
</div>

<p>
这里我们用一个正则表达式代表所有出现的模式（一个包含在尖括号中的字符串），与它的正则表达式命名组等价。
</p>

<p>
re.sub的第一个参数 我们将我们的模式放进括号，目的是把它分配到第一个匹配组。在我们的第二个参数，我们可以使用第一匹配组的内容，方法是写1（2将是第二匹配组的内容，以此类推…….）
</p>

<p>
那么最后，输入模式
</p>

<div class="org-src-container">

<pre class="src src-python">/hello/&lt;username&gt;
</pre>
</div>

<p>
将给我们正则表达式：
</p>
<div class="org-src-container">

<pre class="src src-python">^/hello/<span style="color: #2f96dc;">(</span>?P&lt;username&gt;.+<span style="color: #2f96dc;">)</span>$
</pre>
</div>
</div>
</div>
