python/base/python的函数和对象.html

<div id="outline-container-orgheadline36" class="outline-3">
<h3 id="orgheadline36"><span class="section-number-3">7.6</span> 推陈出新</h3>
<div class="outline-text-3" id="text-7-6">
<p>
让我们扫一眼上次我们写的简单NotFlask类。
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #237fbf; font-weight: bold;">class</span> <span style="color: #ce537a; font-weight: bold;">NotFlask</span><span style="color: #2f96dc;">()</span>:
    <span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">__init__</span><span style="color: #2f96dc;">(</span><span style="color: #237fbf; font-weight: bold;">self</span><span style="color: #2f96dc;">)</span>:
        <span style="color: #237fbf; font-weight: bold;">self</span>.routes = <span style="color: #2f96dc;">{}</span>

    <span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">route</span><span style="color: #2f96dc;">(</span><span style="color: #237fbf; font-weight: bold;">self</span>, route_str<span style="color: #2f96dc;">)</span>:
        <span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">decorator</span><span style="color: #2f96dc;">(</span>f<span style="color: #2f96dc;">)</span>:
            <span style="color: #237fbf; font-weight: bold;">self</span>.routes<span style="color: #2f96dc;">[</span>route_str<span style="color: #2f96dc;">]</span> = f
            <span style="color: #237fbf; font-weight: bold;">return</span> f

        <span style="color: #237fbf; font-weight: bold;">return</span> decorator

    <span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">serve</span><span style="color: #2f96dc;">(</span><span style="color: #237fbf; font-weight: bold;">self</span>, path<span style="color: #2f96dc;">)</span>:
        <span style="color: #7590db;">view_function</span> = <span style="color: #237fbf; font-weight: bold;">self</span>.routes.get<span style="color: #2f96dc;">(</span>path<span style="color: #2f96dc;">)</span>
        <span style="color: #237fbf; font-weight: bold;">if</span> view_function:
            <span style="color: #237fbf; font-weight: bold;">return</span> view_function<span style="color: #2f96dc;">()</span>
        <span style="color: #237fbf; font-weight: bold;">else</span>:
            <span style="color: #237fbf; font-weight: bold;">raise</span> <span style="color: #ce537a; font-weight: bold;">ValueError</span><span style="color: #2f96dc;">(</span><span style="color: #2d9574;">'Route "{}"" has not been registered'</span>.<span style="color: #1f71ab;">format</span><span style="color: #bc6ec5;">(</span>path<span style="color: #bc6ec5;">)</span><span style="color: #2f96dc;">)</span>

<span style="color: #7590db;">app</span> = NotFlask<span style="color: #2f96dc;">()</span>

<span style="color: #ce537a; font-weight: bold;">@app.route</span><span style="color: #2f96dc;">(</span><span style="color: #2d9574;">"/"</span><span style="color: #2f96dc;">)</span>
<span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">hello</span><span style="color: #2f96dc;">()</span>:
    <span style="color: #237fbf; font-weight: bold;">return</span> <span style="color: #2d9574;">"Hello World!"</span>
</pre>
</div>

<p>
现在我们有一个新的改进方法用来匹配输入的路径，我们打算移除我们上一个版本实现时用到的原生字典。
</p>

<p>
让我们从改造我们的函数着手，以便于添加路径，这样我们就可以用(pattern, view_function)对列表代替字典保存我们的路径。
</p>

<p>
这意味着当一个程序员使用@app.route()装饰一个函数，我们将要尝试将他们的路径编译变成一个正则表达式，然后存储它，属于一个在我们新的路径列表里的装饰函数。
</p>

<p>
让我们看看实现代码：
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #237fbf; font-weight: bold;">class</span> <span style="color: #ce537a; font-weight: bold;">NotFlask</span><span style="color: #2f96dc;">()</span>:
    <span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">__init__</span><span style="color: #2f96dc;">(</span><span style="color: #237fbf; font-weight: bold;">self</span><span style="color: #2f96dc;">)</span>:
        <span style="color: #237fbf; font-weight: bold;">self</span>.routes = <span style="color: #2f96dc;">[]</span>

    <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Here's our build_route_pattern we made earlier</span>
    <span style="color: #ce537a; font-weight: bold;">@staticmethod</span>
    <span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">build_route_pattern</span><span style="color: #2f96dc;">(</span>route<span style="color: #2f96dc;">)</span>:
        <span style="color: #7590db;">route_regex</span> = re.sub<span style="color: #2f96dc;">(</span>r<span style="color: #2d9574;">'(&lt;\w+&gt;)'</span>, r<span style="color: #2d9574;">'(?P\1.+)'</span>, route<span style="color: #2f96dc;">)</span>
        <span style="color: #237fbf; font-weight: bold;">return</span> re.<span style="color: #1f71ab;">compile</span><span style="color: #2f96dc;">(</span><span style="color: #2d9574;">"^{}$"</span>.<span style="color: #1f71ab;">format</span><span style="color: #bc6ec5;">(</span>route_regex<span style="color: #bc6ec5;">)</span><span style="color: #2f96dc;">)</span>

    <span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">route</span><span style="color: #2f96dc;">(</span><span style="color: #237fbf; font-weight: bold;">self</span>, route_str<span style="color: #2f96dc;">)</span>:
        <span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">decorator</span><span style="color: #2f96dc;">(</span>f<span style="color: #2f96dc;">)</span>:
            <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Instead of inserting into a dictionary,</span>
            <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">We'll append the tuple to our route list</span>
            <span style="color: #7590db;">route_pattern</span> = <span style="color: #237fbf; font-weight: bold;">self</span>.build_route_pattern<span style="color: #2f96dc;">(</span>route_str<span style="color: #2f96dc;">)</span>
            <span style="color: #237fbf; font-weight: bold;">self</span>.routes.append<span style="color: #2f96dc;">(</span><span style="color: #bc6ec5;">(</span>route_pattern, f<span style="color: #bc6ec5;">)</span><span style="color: #2f96dc;">)</span>

            <span style="color: #237fbf; font-weight: bold;">return</span> f

        <span style="color: #237fbf; font-weight: bold;">return</span> decorator
</pre>
</div>

<p>
我们也打算需要一个get_route_match方法，给它一个路径实例，将会尝试并找到一个匹配的view_function，或者返回None如果一个也找不到的话。
</p>

<p>
然而，如果找了到匹配的话，除了view_function之外，我们还需要返回一个东西，那就是我们包含之前捕获匹配组的字典，我们需要它来为视图函数传递正确的参数。
</p>

<p>
好了我们的get_route_match大概就长这样：
</p>

<pre class="example">
def get_route_match(path):
    for route_pattern, view_function in self.routes:
        m = route_pattern.match(path)
        if m:
           return m.groupdict(), view_function

    return None
</pre>

<p>
现在我们快要完成了，最后一步将是找出调用view_function的方法，使用来自正则表达式匹配组字典的正确参数。
</p>

<p>
调用一个函数的若干种方法
</p>

<p>
让我们回顾一下不同的方法调用一个python的函数。
</p>

<p>
比如像这样：
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">hello_user</span><span style="color: #2f96dc;">(</span>username<span style="color: #2f96dc;">)</span>:
    <span style="color: #237fbf; font-weight: bold;">return</span> <span style="color: #2d9574;">"Hello {}!"</span>.<span style="color: #1f71ab;">format</span><span style="color: #2f96dc;">(</span>username<span style="color: #2f96dc;">)</span>
</pre>
</div>

<p>
最简单的（也许正是你所熟知的）办法是使用正则参数，在这里参数的顺序匹配我们定义的那些函数的顺序。
</p>

<pre class="example">
&gt;&gt;&gt; hello_user("ains")
Hello ains!
</pre>

<p>
另一种方法调用一个函数是使用关键词参数。关键词参数可以通过任何顺序指定，适合有许多可选参数的函数。
</p>
<pre class="example">
&gt;&gt;&gt; hello_user(username="ains")
Hello ains!
</pre>


<p>
在Python中最后一种调用一个函数的方法是使用关键词参数字典，字典中的关键词对应参数名称。我们告诉Python解包一个字典，并通过使用两个星号“**”来把它当作函数的关键词参数。 下面的代码段与上面的代码段完全一样，现在我们使用字典参数，我们可以在运行时动态创建它。
</p>

<pre class="example">
&gt;&gt;&gt; kwargs = {"username": "ains"}
&gt;&gt;&gt; hello_user(**kwargs)
Hello ains!
</pre>

<p>
好了，还记得上面的groupdict()方法？就是那个同样的在正则表达式完成匹配后返回{“username”: “ains”}的家伙？那么现在我们了解了kwargs，我们能很容易向我们的view_function传递字典匹配，完成NotFlask!
</p>

<p>
那么让我们把这些都塞进我们最终的类中。
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #237fbf; font-weight: bold;">class</span> <span style="color: #ce537a; font-weight: bold;">NotFlask</span><span style="color: #2f96dc;">()</span>:
    <span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">__init__</span><span style="color: #2f96dc;">(</span><span style="color: #237fbf; font-weight: bold;">self</span><span style="color: #2f96dc;">)</span>:
        <span style="color: #237fbf; font-weight: bold;">self</span>.routes = <span style="color: #2f96dc;">[]</span>

    <span style="color: #ce537a; font-weight: bold;">@staticmethod</span>
    <span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">build_route_pattern</span><span style="color: #2f96dc;">(</span>route<span style="color: #2f96dc;">)</span>:
        <span style="color: #7590db;">route_regex</span> = re.sub<span style="color: #2f96dc;">(</span>r<span style="color: #2d9574;">'(&lt;\w+&gt;)'</span>, r<span style="color: #2d9574;">'(?P\1.+)'</span>, route<span style="color: #2f96dc;">)</span>
        <span style="color: #237fbf; font-weight: bold;">return</span> re.<span style="color: #1f71ab;">compile</span><span style="color: #2f96dc;">(</span><span style="color: #2d9574;">"^{}$"</span>.<span style="color: #1f71ab;">format</span><span style="color: #bc6ec5;">(</span>route_regex<span style="color: #bc6ec5;">)</span><span style="color: #2f96dc;">)</span>

    <span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">route</span><span style="color: #2f96dc;">(</span><span style="color: #237fbf; font-weight: bold;">self</span>, route_str<span style="color: #2f96dc;">)</span>:
        <span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">decorator</span><span style="color: #2f96dc;">(</span>f<span style="color: #2f96dc;">)</span>:
            <span style="color: #7590db;">route_pattern</span> = <span style="color: #237fbf; font-weight: bold;">self</span>.build_route_pattern<span style="color: #2f96dc;">(</span>route_str<span style="color: #2f96dc;">)</span>
            <span style="color: #237fbf; font-weight: bold;">self</span>.routes.append<span style="color: #2f96dc;">(</span><span style="color: #bc6ec5;">(</span>route_pattern, f<span style="color: #bc6ec5;">)</span><span style="color: #2f96dc;">)</span>

            <span style="color: #237fbf; font-weight: bold;">return</span> f

        <span style="color: #237fbf; font-weight: bold;">return</span> decorator

    <span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">get_route_match</span><span style="color: #2f96dc;">(</span><span style="color: #237fbf; font-weight: bold;">self</span>, path<span style="color: #2f96dc;">)</span>:
        <span style="color: #237fbf; font-weight: bold;">for</span> route_pattern, view_function <span style="color: #237fbf; font-weight: bold;">in</span> <span style="color: #237fbf; font-weight: bold;">self</span>.routes:
            <span style="color: #7590db;">m</span> = route_pattern.match<span style="color: #2f96dc;">(</span>path<span style="color: #2f96dc;">)</span>
            <span style="color: #237fbf; font-weight: bold;">if</span> m:
                <span style="color: #237fbf; font-weight: bold;">return</span> m.groupdict<span style="color: #2f96dc;">()</span>, view_function

        <span style="color: #237fbf; font-weight: bold;">return</span> <span style="color: #a45bad;">None</span>

    <span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">serve</span><span style="color: #2f96dc;">(</span><span style="color: #237fbf; font-weight: bold;">self</span>, path<span style="color: #2f96dc;">)</span>:
        <span style="color: #7590db;">route_match</span> = <span style="color: #237fbf; font-weight: bold;">self</span>.get_route_match<span style="color: #2f96dc;">(</span>path<span style="color: #2f96dc;">)</span>
        <span style="color: #237fbf; font-weight: bold;">if</span> route_match:
            <span style="color: #7590db;">kwargs</span>, <span style="color: #7590db;">view_function</span> = route_match
            <span style="color: #237fbf; font-weight: bold;">return</span> view_function<span style="color: #2f96dc;">(</span>**kwargs<span style="color: #2f96dc;">)</span>
        <span style="color: #237fbf; font-weight: bold;">else</span>:
            <span style="color: #237fbf; font-weight: bold;">raise</span> <span style="color: #ce537a; font-weight: bold;">ValueError</span><span style="color: #2f96dc;">(</span><span style="color: #2d9574;">'Route "{}"" has not been registered'</span>.<span style="color: #1f71ab;">format</span><span style="color: #bc6ec5;">(</span>path<span style="color: #bc6ec5;">)</span><span style="color: #2f96dc;">)</span>
</pre>
</div>

<p>
接下来,就是见证奇迹的时刻，请看下面代码段:
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #7590db;">app</span> = NotFlask<span style="color: #2f96dc;">()</span>

<span style="color: #ce537a; font-weight: bold;">@app.route</span><span style="color: #2f96dc;">(</span><span style="color: #2d9574;">"/hello/&lt;username&gt;"</span><span style="color: #2f96dc;">)</span>
<span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">hello_user</span><span style="color: #2f96dc;">(</span>username<span style="color: #2f96dc;">)</span>:
    <span style="color: #237fbf; font-weight: bold;">return</span> <span style="color: #2d9574;">"Hello {}!"</span>.<span style="color: #1f71ab;">format</span><span style="color: #2f96dc;">(</span>username<span style="color: #2f96dc;">)</span>

<span style="color: #237fbf; font-weight: bold;">print</span> app.serve<span style="color: #2f96dc;">(</span><span style="color: #2d9574;">"/hello/ains"</span><span style="color: #2f96dc;">)</span>
</pre>
</div>

<p>
我们将得到输出：
</p>
<pre class="example">
Hello ains!
</pre>
</div>
</div>
</div>
