python/base/python的函数和对象.org
* 建议阅读:  
pep318 关于迭代器的为什么使用@






* 引用文件
目前没有完全使用, 喜欢可以看看

http://zetcode.com/lang/python/functions/

http://stackoverflow.com/questions/739654/how-can-i-make-a-chain-of-function-decorators-in-python/1594484#1594484


http://www.ibm.com/developerworks/linux/library/l-cpdecor/index.html


http://www.cafepy.com/article/python_types_and_objects/

http://blog.csdn.net/mdl13412/article/details/22608283
