python/base/python的函数和对象.html

<div id="outline-container-orgheadline38" class="outline-2">
<h2 id="orgheadline38"><span class="section-number-2">8</span> 建议阅读:</h2>
<div class="outline-text-2" id="text-8">
<p>
pep318 关于迭代器的为什么使用@
</p>
</div>
</div>






<div id="outline-container-orgheadline39" class="outline-2">
<h2 id="orgheadline39"><span class="section-number-2">9</span> 引用文件</h2>
<div class="outline-text-2" id="text-9">
<p>
目前没有完全使用, 喜欢可以看看
</p>

<p>
<a href="http://zetcode.com/lang/python/functions/">http://zetcode.com/lang/python/functions/</a>
</p>

<p>
<a href="http://stackoverflow.com/questions/739654/how-can-i-make-a-chain-of-function-decorators-in-python/1594484#1594484">http://stackoverflow.com/questions/739654/how-can-i-make-a-chain-of-function-decorators-in-python/1594484#1594484</a>
</p>


<p>
<a href="http://www.ibm.com/developerworks/linux/library/l-cpdecor/index.html">http://www.ibm.com/developerworks/linux/library/l-cpdecor/index.html</a>
</p>


<p>
<a href="http://www.cafepy.com/article/python_types_and_objects/">http://www.cafepy.com/article/python_types_and_objects/</a>
</p>

<p>
<a href="http://blog.csdn.net/mdl13412/article/details/22608283">http://blog.csdn.net/mdl13412/article/details/22608283</a>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2015-11-22 日 17:36</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
